trol73/avr-make/asm/include/m2564RFR2def.inc
;***** THIS IS A MACHINE GENERATED FILE - DO NOT EDIT ********************

;*************************************************************************
;* A P P L I C A T I O N   N O T E   F O R   T H E   A V R   F A M I L Y
;* 
;* Number            : AVR000
;* File Name         : m2564RFR2def.inc
;* Title             : Register/Bit Definitions for the ATmega2564RFR2
;* Created           : 2014-02-06 16:08
;* Version           : 1.00
;* Support e-mail    : avr@atmel.com
;* Target MCU        : ATmega2564RFR2
;* 
;* DESCRIPTION
;* When including this file in the assembly program file, all I/O register 
;* names and I/O register bit names appearing in the data book can be used.
;* In addition, the six registers forming the three data pointers X, Y and 
;* Z have been assigned names XL - ZH. Highest RAM address for Internal 
;* SRAM is also defined 
;* 
;*************************************************************************

#ifndef _M2564RFR2DEF_INC_
#define _M2564RFR2DEF_INC_


#pragma partinc 0

; ***** SPECIFY DEVICE ***************************************************
.device	ATmega2564RFR2
#pragma AVRPART ADMIN PART_NAME ATmega2564RFR2
.equ	SIGNATURE_000	= 0x1E
.equ	SIGNATURE_001	= 0xA8
.equ	SIGNATURE_002	= 0x03

#pragma AVRPART CORE CORE_VERSION V3

; ***** I/O REGISTER DEFINITIONS *****************************************
; NOTE:
; Definitions marked "MEMORY MAPPED" are extended I/O ports
; and cannot be used with IN/OUT instructions
.equ	TRXFBEND	= 0x1FF ; MEMORY MAPPED
.equ	TRXFBST	= 0x180 ; MEMORY MAPPED
.equ	TST_RX_LENGTH	= 0x17B ; MEMORY MAPPED
.equ	TST_CTRL_DIGI	= 0x176 ; MEMORY MAPPED
.equ	CSMA_BE	= 0x16F ; MEMORY MAPPED
.equ	CSMA_SEED_1	= 0x16E ; MEMORY MAPPED
.equ	CSMA_SEED_0	= 0x16D ; MEMORY MAPPED
.equ	XAH_CTRL_0	= 0x16C ; MEMORY MAPPED
.equ	IEEE_ADDR_7	= 0x16B ; MEMORY MAPPED
.equ	IEEE_ADDR_6	= 0x16A ; MEMORY MAPPED
.equ	IEEE_ADDR_5	= 0x169 ; MEMORY MAPPED
.equ	IEEE_ADDR_4	= 0x168 ; MEMORY MAPPED
.equ	IEEE_ADDR_3	= 0x167 ; MEMORY MAPPED
.equ	IEEE_ADDR_2	= 0x166 ; MEMORY MAPPED
.equ	IEEE_ADDR_1	= 0x165 ; MEMORY MAPPED
.equ	IEEE_ADDR_0	= 0x164 ; MEMORY MAPPED
.equ	PAN_ID_1	= 0x163 ; MEMORY MAPPED
.equ	PAN_ID_0	= 0x162 ; MEMORY MAPPED
.equ	SHORT_ADDR_1	= 0x161 ; MEMORY MAPPED
.equ	SHORT_ADDR_0	= 0x160 ; MEMORY MAPPED
.equ	MAN_ID_1	= 0x15F ; MEMORY MAPPED
.equ	MAN_ID_0	= 0x15E ; MEMORY MAPPED
.equ	VERSION_NUM	= 0x15D ; MEMORY MAPPED
.equ	PART_NUM	= 0x15C ; MEMORY MAPPED
.equ	PLL_DCU	= 0x15B ; MEMORY MAPPED
.equ	PLL_CF	= 0x15A ; MEMORY MAPPED
.equ	FTN_CTRL	= 0x158 ; MEMORY MAPPED
.equ	XAH_CTRL_1	= 0x157 ; MEMORY MAPPED
.equ	TRX_RPC	= 0x156 ; MEMORY MAPPED
.equ	RX_SYN	= 0x155 ; MEMORY MAPPED
.equ	CC_CTRL_1	= 0x154 ; MEMORY MAPPED
.equ	CC_CTRL_0	= 0x153 ; MEMORY MAPPED
.equ	XOSC_CTRL	= 0x152 ; MEMORY MAPPED
.equ	BATMON	= 0x151 ; MEMORY MAPPED
.equ	VREG_CTRL	= 0x150 ; MEMORY MAPPED
.equ	IRQ_STATUS	= 0x14F ; MEMORY MAPPED
.equ	IRQ_MASK	= 0x14E ; MEMORY MAPPED
.equ	ANT_DIV	= 0x14D ; MEMORY MAPPED
.equ	TRX_CTRL_2	= 0x14C ; MEMORY MAPPED
.equ	SFD_VALUE	= 0x14B ; MEMORY MAPPED
.equ	RX_CTRL	= 0x14A ; MEMORY MAPPED
.equ	CCA_THRES	= 0x149 ; MEMORY MAPPED
.equ	PHY_CC_CCA	= 0x148 ; MEMORY MAPPED
.equ	PHY_ED_LEVEL	= 0x147 ; MEMORY MAPPED
.equ	PHY_RSSI	= 0x146 ; MEMORY MAPPED
.equ	PHY_TX_PWR	= 0x145 ; MEMORY MAPPED
.equ	TRX_CTRL_1	= 0x144 ; MEMORY MAPPED
.equ	TRX_CTRL_0	= 0x143 ; MEMORY MAPPED
.equ	TRX_STATE	= 0x142 ; MEMORY MAPPED
.equ	TRX_STATUS	= 0x141 ; MEMORY MAPPED
.equ	AES_KEY	= 0x13F ; MEMORY MAPPED
.equ	AES_STATE	= 0x13E ; MEMORY MAPPED
.equ	AES_STATUS	= 0x13D ; MEMORY MAPPED
.equ	AES_CTRL	= 0x13C ; MEMORY MAPPED
.equ	TRXPR	= 0x139 ; MEMORY MAPPED
.equ	PARCR	= 0x138 ; MEMORY MAPPED
.equ	DPDS1	= 0x137 ; MEMORY MAPPED
.equ	DPDS0	= 0x136 ; MEMORY MAPPED
.equ	DRTRAM0	= 0x135 ; MEMORY MAPPED
.equ	DRTRAM1	= 0x134 ; MEMORY MAPPED
.equ	DRTRAM2	= 0x133 ; MEMORY MAPPED
.equ	DRTRAM3	= 0x132 ; MEMORY MAPPED
.equ	LLDRH	= 0x131 ; MEMORY MAPPED
.equ	LLDRL	= 0x130 ; MEMORY MAPPED
.equ	LLCR	= 0x12F ; MEMORY MAPPED
.equ	OCR5CH	= 0x12D ; MEMORY MAPPED
.equ	OCR5CL	= 0x12C ; MEMORY MAPPED
.equ	OCR5BH	= 0x12B ; MEMORY MAPPED
.equ	OCR5BL	= 0x12A ; MEMORY MAPPED
.equ	OCR5AH	= 0x129 ; MEMORY MAPPED
.equ	OCR5AL	= 0x128 ; MEMORY MAPPED
.equ	ICR5H	= 0x127 ; MEMORY MAPPED
.equ	ICR5L	= 0x126 ; MEMORY MAPPED
.equ	TCNT5H	= 0x125 ; MEMORY MAPPED
.equ	TCNT5L	= 0x124 ; MEMORY MAPPED
.equ	TCCR5C	= 0x122 ; MEMORY MAPPED
.equ	TCCR5B	= 0x121 ; MEMORY MAPPED
.equ	TCCR5A	= 0x120 ; MEMORY MAPPED
.equ	MAFPA3H	= 0x11D ; MEMORY MAPPED
.equ	MAFPA3L	= 0x11C ; MEMORY MAPPED
.equ	MAFSA3H	= 0x11B ; MEMORY MAPPED
.equ	MAFSA3L	= 0x11A ; MEMORY MAPPED
.equ	MAFPA2H	= 0x119 ; MEMORY MAPPED
.equ	MAFPA2L	= 0x118 ; MEMORY MAPPED
.equ	MAFSA2H	= 0x117 ; MEMORY MAPPED
.equ	MAFSA2L	= 0x116 ; MEMORY MAPPED
.equ	MAFPA1H	= 0x115 ; MEMORY MAPPED
.equ	MAFPA1L	= 0x114 ; MEMORY MAPPED
.equ	MAFSA1H	= 0x113 ; MEMORY MAPPED
.equ	MAFSA1L	= 0x112 ; MEMORY MAPPED
.equ	MAFPA0H	= 0x111 ; MEMORY MAPPED
.equ	MAFPA0L	= 0x110 ; MEMORY MAPPED
.equ	MAFSA0H	= 0x10F ; MEMORY MAPPED
.equ	MAFSA0L	= 0x10E ; MEMORY MAPPED
.equ	MAFCR1	= 0x10D ; MEMORY MAPPED
.equ	MAFCR0	= 0x10C ; MEMORY MAPPED
.equ	SCTSTRHH	= 0xFC ; MEMORY MAPPED
.equ	SCTSTRHL	= 0xFB ; MEMORY MAPPED
.equ	SCTSTRLH	= 0xFA ; MEMORY MAPPED
.equ	SCTSTRLL	= 0xF9 ; MEMORY MAPPED
.equ	SCOCR1HH	= 0xF8 ; MEMORY MAPPED
.equ	SCOCR1HL	= 0xF7 ; MEMORY MAPPED
.equ	SCOCR1LH	= 0xF6 ; MEMORY MAPPED
.equ	SCOCR1LL	= 0xF5 ; MEMORY MAPPED
.equ	SCOCR2HH	= 0xF4 ; MEMORY MAPPED
.equ	SCOCR2HL	= 0xF3 ; MEMORY MAPPED
.equ	SCOCR2LH	= 0xF2 ; MEMORY MAPPED
.equ	SCOCR2LL	= 0xF1 ; MEMORY MAPPED
.equ	SCOCR3HH	= 0xF0 ; MEMORY MAPPED
.equ	SCOCR3HL	= 0xEF ; MEMORY MAPPED
.equ	SCOCR3LH	= 0xEE ; MEMORY MAPPED
.equ	SCOCR3LL	= 0xED ; MEMORY MAPPED
.equ	SCTSRHH	= 0xEC ; MEMORY MAPPED
.equ	SCTSRHL	= 0xEB ; MEMORY MAPPED
.equ	SCTSRLH	= 0xEA ; MEMORY MAPPED
.equ	SCTSRLL	= 0xE9 ; MEMORY MAPPED
.equ	SCBTSRHH	= 0xE8 ; MEMORY MAPPED
.equ	SCBTSRHL	= 0xE7 ; MEMORY MAPPED
.equ	SCBTSRLH	= 0xE6 ; MEMORY MAPPED
.equ	SCBTSRLL	= 0xE5 ; MEMORY MAPPED
.equ	SCCNTHH	= 0xE4 ; MEMORY MAPPED
.equ	SCCNTHL	= 0xE3 ; MEMORY MAPPED
.equ	SCCNTLH	= 0xE2 ; MEMORY MAPPED
.equ	SCCNTLL	= 0xE1 ; MEMORY MAPPED
.equ	SCIRQS	= 0xE0 ; MEMORY MAPPED
.equ	SCIRQM	= 0xDF ; MEMORY MAPPED
.equ	SCSR	= 0xDE ; MEMORY MAPPED
.equ	SCCR1	= 0xDD ; MEMORY MAPPED
.equ	SCCR0	= 0xDC ; MEMORY MAPPED
.equ	SCCSR	= 0xDB ; MEMORY MAPPED
.equ	SCRSTRHH	= 0xDA ; MEMORY MAPPED
.equ	SCRSTRHL	= 0xD9 ; MEMORY MAPPED
.equ	SCRSTRLH	= 0xD8 ; MEMORY MAPPED
.equ	SCRSTRLL	= 0xD7 ; MEMORY MAPPED
.equ	UDR1	= 0xCE ; MEMORY MAPPED
.equ	UBRR1H	= 0xCD ; MEMORY MAPPED
.equ	UBRR1L	= 0xCC ; MEMORY MAPPED
.equ	UCSR1C	= 0xCA ; MEMORY MAPPED
.equ	UCSR1B	= 0xC9 ; MEMORY MAPPED
.equ	UCSR1A	= 0xC8 ; MEMORY MAPPED
.equ	UDR0	= 0xC6 ; MEMORY MAPPED
.equ	UBRR0H	= 0xC5 ; MEMORY MAPPED
.equ	UBRR0L	= 0xC4 ; MEMORY MAPPED
.equ	UCSR0C	= 0xC2 ; MEMORY MAPPED
.equ	UCSR0B	= 0xC1 ; MEMORY MAPPED
.equ	UCSR0A	= 0xC0 ; MEMORY MAPPED
.equ	IRQ_STATUS1	= 0xBF ; MEMORY MAPPED
.equ	IRQ_MASK1	= 0xBE ; MEMORY MAPPED
.equ	TWAMR	= 0xBD ; MEMORY MAPPED
.equ	TWCR	= 0xBC ; MEMORY MAPPED
.equ	TWDR	= 0xBB ; MEMORY MAPPED
.equ	TWAR	= 0xBA ; MEMORY MAPPED
.equ	TWSR	= 0xB9 ; MEMORY MAPPED
.equ	TWBR	= 0xB8 ; MEMORY MAPPED
.equ	ASSR	= 0xB6 ; MEMORY MAPPED
.equ	OCR2B	= 0xB4 ; MEMORY MAPPED
.equ	OCR2A	= 0xB3 ; MEMORY MAPPED
.equ	TCNT2	= 0xB2 ; MEMORY MAPPED
.equ	TCCR2B	= 0xB1 ; MEMORY MAPPED
.equ	TCCR2A	= 0xB0 ; MEMORY MAPPED
.equ	OCR4CH	= 0xAD ; MEMORY MAPPED
.equ	OCR4CL	= 0xAC ; MEMORY MAPPED
.equ	OCR4BH	= 0xAB ; MEMORY MAPPED
.equ	OCR4BL	= 0xAA ; MEMORY MAPPED
.equ	OCR4AH	= 0xA9 ; MEMORY MAPPED
.equ	OCR4AL	= 0xA8 ; MEMORY MAPPED
.equ	ICR4H	= 0xA7 ; MEMORY MAPPED
.equ	ICR4L	= 0xA6 ; MEMORY MAPPED
.equ	TCNT4H	= 0xA5 ; MEMORY MAPPED
.equ	TCNT4L	= 0xA4 ; MEMORY MAPPED
.equ	TCCR4C	= 0xA2 ; MEMORY MAPPED
.equ	TCCR4B	= 0xA1 ; MEMORY MAPPED
.equ	TCCR4A	= 0xA0 ; MEMORY MAPPED
.equ	OCR3CH	= 0x9D ; MEMORY MAPPED
.equ	OCR3CL	= 0x9C ; MEMORY MAPPED
.equ	OCR3BH	= 0x9B ; MEMORY MAPPED
.equ	OCR3BL	= 0x9A ; MEMORY MAPPED
.equ	OCR3AH	= 0x99 ; MEMORY MAPPED
.equ	OCR3AL	= 0x98 ; MEMORY MAPPED
.equ	ICR3H	= 0x97 ; MEMORY MAPPED
.equ	ICR3L	= 0x96 ; MEMORY MAPPED
.equ	TCNT3H	= 0x95 ; MEMORY MAPPED
.equ	TCNT3L	= 0x94 ; MEMORY MAPPED
.equ	TCCR3C	= 0x92 ; MEMORY MAPPED
.equ	TCCR3B	= 0x91 ; MEMORY MAPPED
.equ	TCCR3A	= 0x90 ; MEMORY MAPPED
.equ	OCR1CH	= 0x8D ; MEMORY MAPPED
.equ	OCR1CL	= 0x8C ; MEMORY MAPPED
.equ	OCR1BH	= 0x8B ; MEMORY MAPPED
.equ	OCR1BL	= 0x8A ; MEMORY MAPPED
.equ	OCR1AH	= 0x89 ; MEMORY MAPPED
.equ	OCR1AL	= 0x88 ; MEMORY MAPPED
.equ	ICR1H	= 0x87 ; MEMORY MAPPED
.equ	ICR1L	= 0x86 ; MEMORY MAPPED
.equ	TCNT1H	= 0x85 ; MEMORY MAPPED
.equ	TCNT1L	= 0x84 ; MEMORY MAPPED
.equ	TCCR1C	= 0x82 ; MEMORY MAPPED
.equ	TCCR1B	= 0x81 ; MEMORY MAPPED
.equ	TCCR1A	= 0x80 ; MEMORY MAPPED
.equ	DIDR1	= 0x7F ; MEMORY MAPPED
.equ	DIDR0	= 0x7E ; MEMORY MAPPED
.equ	DIDR2	= 0x7D ; MEMORY MAPPED
.equ	ADMUX	= 0x7C ; MEMORY MAPPED
.equ	ADCSRB	= 0x7B ; MEMORY MAPPED
.equ	ADCSRA	= 0x7A ; MEMORY MAPPED
.equ	ADCH	= 0x79 ; MEMORY MAPPED
.equ	ADCL	= 0x78 ; MEMORY MAPPED
.equ	ADCSRC	= 0x77 ; MEMORY MAPPED
.equ	NEMCR	= 0x75 ; MEMORY MAPPED
.equ	TIMSK5	= 0x73 ; MEMORY MAPPED
.equ	TIMSK4	= 0x72 ; MEMORY MAPPED
.equ	TIMSK3	= 0x71 ; MEMORY MAPPED
.equ	TIMSK2	= 0x70 ; MEMORY MAPPED
.equ	TIMSK1	= 0x6F ; MEMORY MAPPED
.equ	TIMSK0	= 0x6E ; MEMORY MAPPED
.equ	PCMSK2	= 0x6D ; MEMORY MAPPED
.equ	PCMSK1	= 0x6C ; MEMORY MAPPED
.equ	PCMSK0	= 0x6B ; MEMORY MAPPED
.equ	EICRB	= 0x6A ; MEMORY MAPPED
.equ	EICRA	= 0x69 ; MEMORY MAPPED
.equ	PCICR	= 0x68 ; MEMORY MAPPED
.equ	BGCR	= 0x67 ; MEMORY MAPPED
.equ	OSCCAL	= 0x66 ; MEMORY MAPPED
.equ	PRR1	= 0x65 ; MEMORY MAPPED
.equ	PRR0	= 0x64 ; MEMORY MAPPED
.equ	PRR2	= 0x63 ; MEMORY MAPPED
.equ	CLKPR	= 0x61 ; MEMORY MAPPED
.equ	WDTCSR	= 0x60 ; MEMORY MAPPED
.equ	SREG	= 0x3F ; 
.equ	SPH	= 0x3E ; 
.equ	SPL	= 0x3D ; 
.equ	EIND	= 0x3C ; 
.equ	RAMPZ	= 0x3B ; 
.equ	SPMCSR	= 0x37 ; 
.equ	MCUCR	= 0x35 ; 
.equ	MCUSR	= 0x34 ; 
.equ	SMCR	= 0x33 ; 
.equ	OCDR	= 0x31 ; 
.equ	ACSR	= 0x30 ; 
.equ	SPDR	= 0x2E ; 
.equ	SPSR	= 0x2D ; 
.equ	SPCR	= 0x2C ; 
.equ	GPIOR2	= 0x2B ; 
.equ	GPIOR1	= 0x2A ; 
.equ	OCR0B	= 0x28 ; 
.equ	OCR0A	= 0x27 ; 
.equ	TCNT0	= 0x26 ; 
.equ	TCCR0B	= 0x25 ; 
.equ	TCCR0A	= 0x24 ; 
.equ	GTCCR	= 0x23 ; 
.equ	EEARH	= 0x22 ; 
.equ	EEARL	= 0x21 ; 
.equ	EEDR	= 0x20 ; 
.equ	EECR	= 0x1F ; 
.equ	GPIOR0	= 0x1E ; 
.equ	EIMSK	= 0x1D ; 
.equ	EIFR	= 0x1C ; 
.equ	PCIFR	= 0x1B ; 
.equ	TIFR5	= 0x1A ; 
.equ	TIFR4	= 0x19 ; 
.equ	TIFR3	= 0x18 ; 
.equ	TIFR2	= 0x17 ; 
.equ	TIFR1	= 0x16 ; 
.equ	TIFR0	= 0x15 ; 
.equ	PORTG	= 0x14 ; 
.equ	DDRG	= 0x13 ; 
.equ	PING	= 0x12 ; 
.equ	PORTF	= 0x11 ; 
.equ	DDRF	= 0x10 ; 
.equ	PINF	= 0x0F ; 
.equ	PORTE	= 0x0E ; 
.equ	DDRE	= 0x0D ; 
.equ	PINE	= 0x0C ; 
.equ	PORTD	= 0x0B ; 
.equ	DDRD	= 0x0A ; 
.equ	PIND	= 0x09 ; 
.equ	PORTC	= 0x08 ; 
.equ	DDRC	= 0x07 ; 
.equ	PINC	= 0x06 ; 
.equ	PORTB	= 0x05 ; 
.equ	DDRB	= 0x04 ; 
.equ	PINB	= 0x03 ; 
.equ	PORTA	= 0x02 ; 
.equ	DDRA	= 0x01 ; 
.equ	PINA	= 0x00 ; 


; ***** BIT DEFINITIONS **************************************************

; ***** ANALOG_COMPARATOR *****************
; ADCSRB - ADC Control and Status Register B
.equ	ACME	= 6 ; Analog Comparator Multiplexer Enable

; ACSR - Analog Comparator Control And Status Register
.equ	ACIS0	= 0 ; Analog Comparator Interrupt Mode Select
.equ	ACIS1	= 1 ; Analog Comparator Interrupt Mode Select
.equ	ACIC	= 2 ; Analog Comparator Input Capture Enable
.equ	ACIE	= 3 ; Analog Comparator Interrupt Enable
.equ	ACI	= 4 ; Analog Comparator Interrupt Flag
.equ	ACO	= 5 ; Analog Compare Output
.equ	ACBG	= 6 ; Analog Comparator Bandgap Select
.equ	ACD	= 7 ; Analog Comparator Disable

