trol73/avr-make/asm/include/m2564RFR2def.inc
; DIDR1 - Digital Input Disable Register 1
.equ	AIN0D	= 0 ; AIN0 Digital Input Disable
.equ	AIN1D	= 1 ; AIN1 Digital Input Disable


; ***** USART0 *****************
; UDR0 - USART0 I/O Data Register
.equ	UDR00	= 0 ; USART0 I/O Data Register Bit 0
.equ	UDR01	= 1 ; USART0 I/O Data Register Bit 1
.equ	UDR02	= 2 ; USART0 I/O Data Register Bit 2
.equ	UDR03	= 3 ; USART0 I/O Data Register Bit 3
.equ	UDR04	= 4 ; USART0 I/O Data Register Bit 4
.equ	UDR05	= 5 ; USART0 I/O Data Register Bit 5
.equ	UDR06	= 6 ; USART0 I/O Data Register Bit 6
.equ	UDR07	= 7 ; USART0 I/O Data Register Bit 7

; UCSR0A - USART0 Control and Status Register A
.equ	MPCM0	= 0 ; Multi-processor Communication Mode
.equ	U2X0	= 1 ; Double the USART Transmission Speed
.equ	UPE0	= 2 ; USART Parity Error
.equ	DOR0	= 3 ; Data OverRun
.equ	FE0	= 4 ; Frame Error
.equ	UDRE0	= 5 ; USART Data Register Empty
.equ	TXC0	= 6 ; USART Transmit Complete
.equ	RXC0	= 7 ; USART Receive Complete

; UCSR0B - USART0 Control and Status Register B
.equ	TXB80	= 0 ; Transmit Data Bit 8
.equ	RXB80	= 1 ; Receive Data Bit 8
.equ	UCSZ02	= 2 ; Character Size
.equ	TXEN0	= 3 ; Transmitter Enable
.equ	RXEN0	= 4 ; Receiver Enable
.equ	UDRIE0	= 5 ; USART Data Register Empty Interrupt Enable
.equ	TXCIE0	= 6 ; TX Complete Interrupt Enable
.equ	RXCIE0	= 7 ; RX Complete Interrupt Enable

; UCSR0C - USART0 Control and Status Register C
.equ	UCPOL0	= 0 ; Clock Polarity
.equ	UCSZ00	= 1 ; Character Size
.equ	UCSZ01	= 2 ; Character Size
.equ	USBS0	= 3 ; Stop Bit Select
.equ	UPM00	= 4 ; Parity Mode
.equ	UPM01	= 5 ; Parity Mode
.equ	UMSEL00	= 6 ; USART Mode Select
.equ	UMSEL01	= 7 ; USART Mode Select

; UBRR0 - USART0 Baud Rate Register  Bytes
.equ	UBRR0H0	= 0 ; USART0 Baud Rate Register  Bytes High Bit 8
.equ	UBRR0H1	= 1 ; USART0 Baud Rate Register  Bytes High Bit 9
.equ	UBRR0H2	= 2 ; USART0 Baud Rate Register  Bytes High Bit 10
.equ	UBRR0H3	= 3 ; USART0 Baud Rate Register  Bytes High Bit 11
.equ	UBRR0H4	= 4 ; USART0 Baud Rate Register  Bytes High Bit 12
.equ	UBRR0H5	= 5 ; USART0 Baud Rate Register  Bytes High Bit 13
.equ	UBRR0H6	= 6 ; USART0 Baud Rate Register  Bytes High Bit 14
.equ	UBRR0H7	= 7 ; USART0 Baud Rate Register  Bytes High Bit 15

.equ	UBRR0L0	= 0 ; USART0 Baud Rate Register  Bytes Low Bit 0
.equ	UBRR0L1	= 1 ; USART0 Baud Rate Register  Bytes Low Bit 1
.equ	UBRR0L2	= 2 ; USART0 Baud Rate Register  Bytes Low Bit 2
.equ	UBRR0L3	= 3 ; USART0 Baud Rate Register  Bytes Low Bit 3
.equ	UBRR0L4	= 4 ; USART0 Baud Rate Register  Bytes Low Bit 4
.equ	UBRR0L5	= 5 ; USART0 Baud Rate Register  Bytes Low Bit 5
.equ	UBRR0L6	= 6 ; USART0 Baud Rate Register  Bytes Low Bit 6
.equ	UBRR0L7	= 7 ; USART0 Baud Rate Register  Bytes Low Bit 7


; ***** USART1 *****************
; UDR1 - USART1 I/O Data Register
.equ	UDR10	= 0 ; USART1 I/O Data Register Bit 0
.equ	UDR11	= 1 ; USART1 I/O Data Register Bit 1
.equ	UDR12	= 2 ; USART1 I/O Data Register Bit 2
.equ	UDR13	= 3 ; USART1 I/O Data Register Bit 3
.equ	UDR14	= 4 ; USART1 I/O Data Register Bit 4
.equ	UDR15	= 5 ; USART1 I/O Data Register Bit 5
.equ	UDR16	= 6 ; USART1 I/O Data Register Bit 6
.equ	UDR17	= 7 ; USART1 I/O Data Register Bit 7

; UCSR1A - USART1 Control and Status Register A
.equ	MPCM1	= 0 ; Multi-processor Communication Mode
.equ	U2X1	= 1 ; Double the USART Transmission Speed
.equ	UPE1	= 2 ; USART Parity Error
.equ	DOR1	= 3 ; Data OverRun
.equ	FE1	= 4 ; Frame Error
.equ	UDRE1	= 5 ; USART Data Register Empty
.equ	TXC1	= 6 ; USART Transmit Complete
.equ	RXC1	= 7 ; USART Receive Complete

; UCSR1B - USART1 Control and Status Register B
.equ	TXB81	= 0 ; Transmit Data Bit 8
.equ	RXB81	= 1 ; Receive Data Bit 8
.equ	UCSZ12	= 2 ; Character Size
.equ	TXEN1	= 3 ; Transmitter Enable
.equ	RXEN1	= 4 ; Receiver Enable
.equ	UDRIE1	= 5 ; USART Data Register Empty Interrupt Enable
.equ	TXCIE1	= 6 ; TX Complete Interrupt Enable
.equ	RXCIE1	= 7 ; RX Complete Interrupt Enable

; UCSR1C - USART1 Control and Status Register C
.equ	UCPOL1	= 0 ; Clock Polarity
.equ	UCSZ10	= 1 ; Character Size
.equ	UCSZ11	= 2 ; Character Size
.equ	USBS1	= 3 ; Stop Bit Select
.equ	UPM10	= 4 ; Parity Mode
.equ	UPM11	= 5 ; Parity Mode
.equ	UMSEL10	= 6 ; USART Mode Select
.equ	UMSEL11	= 7 ; USART Mode Select

; UBRR1 - USART1 Baud Rate Register  Bytes
.equ	UBRR1H0	= 0 ; USART1 Baud Rate Register  Bytes High Bit 8
.equ	UBRR1H1	= 1 ; USART1 Baud Rate Register  Bytes High Bit 9
.equ	UBRR1H2	= 2 ; USART1 Baud Rate Register  Bytes High Bit 10
.equ	UBRR1H3	= 3 ; USART1 Baud Rate Register  Bytes High Bit 11
.equ	UBRR1H4	= 4 ; USART1 Baud Rate Register  Bytes High Bit 12
.equ	UBRR1H5	= 5 ; USART1 Baud Rate Register  Bytes High Bit 13
.equ	UBRR1H6	= 6 ; USART1 Baud Rate Register  Bytes High Bit 14
.equ	UBRR1H7	= 7 ; USART1 Baud Rate Register  Bytes High Bit 15

.equ	UBRR1L0	= 0 ; USART1 Baud Rate Register  Bytes Low Bit 0
.equ	UBRR1L1	= 1 ; USART1 Baud Rate Register  Bytes Low Bit 1
.equ	UBRR1L2	= 2 ; USART1 Baud Rate Register  Bytes Low Bit 2
.equ	UBRR1L3	= 3 ; USART1 Baud Rate Register  Bytes Low Bit 3
.equ	UBRR1L4	= 4 ; USART1 Baud Rate Register  Bytes Low Bit 4
.equ	UBRR1L5	= 5 ; USART1 Baud Rate Register  Bytes Low Bit 5
.equ	UBRR1L6	= 6 ; USART1 Baud Rate Register  Bytes Low Bit 6
.equ	UBRR1L7	= 7 ; USART1 Baud Rate Register  Bytes Low Bit 7


; ***** TWI *****************
; TWAMR - TWI (Slave) Address Mask Register
.equ	Res	= 0 ; Reserved Bit
.equ	TWAM0	= 1 ; TWI Address Mask
.equ	TWAM1	= 2 ; TWI Address Mask
.equ	TWAM2	= 3 ; TWI Address Mask
.equ	TWAM3	= 4 ; TWI Address Mask
.equ	TWAM4	= 5 ; TWI Address Mask
.equ	TWAM5	= 6 ; TWI Address Mask
.equ	TWAM6	= 7 ; TWI Address Mask

; TWBR - TWI Bit Rate Register
.equ	TWBR0	= 0 ; TWI Bit Rate Register Bit 0
.equ	TWBR1	= 1 ; TWI Bit Rate Register Bit 1
.equ	TWBR2	= 2 ; TWI Bit Rate Register Bit 2
.equ	TWBR3	= 3 ; TWI Bit Rate Register Bit 3
.equ	TWBR4	= 4 ; TWI Bit Rate Register Bit 4
.equ	TWBR5	= 5 ; TWI Bit Rate Register Bit 5
.equ	TWBR6	= 6 ; TWI Bit Rate Register Bit 6
.equ	TWBR7	= 7 ; TWI Bit Rate Register Bit 7

; TWCR - TWI Control Register
.equ	TWIE	= 0 ; TWI Interrupt Enable
.equ	TWEN	= 2 ; TWI Enable Bit
.equ	TWWC	= 3 ; TWI Write Collision Flag
.equ	TWSTO	= 4 ; TWI STOP Condition Bit
.equ	TWSTA	= 5 ; TWI START Condition Bit
.equ	TWEA	= 6 ; TWI Enable Acknowledge Bit
.equ	TWINT	= 7 ; TWI Interrupt Flag

; TWSR - TWI Status Register
.equ	TWPS0	= 0 ; TWI Prescaler Bits
.equ	TWPS1	= 1 ; TWI Prescaler Bits
.equ	TWS3	= 3 ; TWI Status
.equ	TWS4	= 4 ; TWI Status
.equ	TWS5	= 5 ; TWI Status
.equ	TWS6	= 6 ; TWI Status
.equ	TWS7	= 7 ; TWI Status

; TWDR - TWI Data Register
.equ	TWDR0	= 0 ; TWI Data Register Bit 0
.equ	TWDR1	= 1 ; TWI Data Register Bit 1
.equ	TWDR2	= 2 ; TWI Data Register Bit 2
.equ	TWDR3	= 3 ; TWI Data Register Bit 3
.equ	TWDR4	= 4 ; TWI Data Register Bit 4
.equ	TWDR5	= 5 ; TWI Data Register Bit 5
.equ	TWDR6	= 6 ; TWI Data Register Bit 6
.equ	TWDR7	= 7 ; TWI Data Register Bit 7

