trol73/avr-make/asm/include/m2564RFR2def.inc
; TWAR - TWI (Slave) Address Register
.equ	TWGCE	= 0 ; TWI General Call Recognition Enable Bit
.equ	TWA0	= 1 ; TWI (Slave) Address
.equ	TWA1	= 2 ; TWI (Slave) Address
.equ	TWA2	= 3 ; TWI (Slave) Address
.equ	TWA3	= 4 ; TWI (Slave) Address
.equ	TWA4	= 5 ; TWI (Slave) Address
.equ	TWA5	= 6 ; TWI (Slave) Address
.equ	TWA6	= 7 ; TWI (Slave) Address


; ***** SPI *****************
; SPCR - SPI Control Register
.equ	SPR0	= 0 ; SPI Clock Rate Select 1 and 0
.equ	SPR1	= 1 ; SPI Clock Rate Select 1 and 0
.equ	CPHA	= 2 ; Clock Phase
.equ	CPOL	= 3 ; Clock polarity
.equ	MSTR	= 4 ; Master/Slave Select
.equ	DORD	= 5 ; Data Order
.equ	SPE	= 6 ; SPI Enable
.equ	SPIE	= 7 ; SPI Interrupt Enable

; SPSR - SPI Status Register
.equ	SPI2X	= 0 ; Double SPI Speed Bit
.equ	Res0	= 1 ; Reserved
.equ	Res1	= 2 ; Reserved
.equ	Res2	= 3 ; Reserved
.equ	Res3	= 4 ; Reserved
.equ	Res4	= 5 ; Reserved
.equ	WCOL	= 6 ; Write Collision Flag
.equ	SPIF	= 7 ; SPI Interrupt Flag

; SPDR - SPI Data Register
.equ	SPDR0	= 0 ; SPI Data Register Bit 0
.equ	SPDR1	= 1 ; SPI Data Register Bit 1
.equ	SPDR2	= 2 ; SPI Data Register Bit 2
.equ	SPDR3	= 3 ; SPI Data Register Bit 3
.equ	SPDR4	= 4 ; SPI Data Register Bit 4
.equ	SPDR5	= 5 ; SPI Data Register Bit 5
.equ	SPDR6	= 6 ; SPI Data Register Bit 6
.equ	SPDR7	= 7 ; SPI Data Register Bit 7


; ***** PORTA *****************
; PORTA - Port A Data Register
.equ	PORTA0	= 0 ; Port A Data Register Bit 0
.equ	PORTA1	= 1 ; Port A Data Register Bit 1
.equ	PORTA2	= 2 ; Port A Data Register Bit 2
.equ	PORTA3	= 3 ; Port A Data Register Bit 3
.equ	PORTA4	= 4 ; Port A Data Register Bit 4
.equ	PORTA5	= 5 ; Port A Data Register Bit 5
.equ	PORTA6	= 6 ; Port A Data Register Bit 6
.equ	PORTA7	= 7 ; Port A Data Register Bit 7

; DDRA - Port A Data Direction Register
.equ	DDRA0	= 0 ; Port A Data Direction Register Bit 0
.equ	DDRA1	= 1 ; Port A Data Direction Register Bit 1
.equ	DDRA2	= 2 ; Port A Data Direction Register Bit 2
.equ	DDRA3	= 3 ; Port A Data Direction Register Bit 3
.equ	DDRA4	= 4 ; Port A Data Direction Register Bit 4
.equ	DDRA5	= 5 ; Port A Data Direction Register Bit 5
.equ	DDRA6	= 6 ; Port A Data Direction Register Bit 6
.equ	DDRA7	= 7 ; Port A Data Direction Register Bit 7

; PINA - Port A Input Pins Address
.equ	PINA0	= 0 ; Port A Input Pins Address Bit 0
.equ	PINA1	= 1 ; Port A Input Pins Address Bit 1
.equ	PINA2	= 2 ; Port A Input Pins Address Bit 2
.equ	PINA3	= 3 ; Port A Input Pins Address Bit 3
.equ	PINA4	= 4 ; Port A Input Pins Address Bit 4
.equ	PINA5	= 5 ; Port A Input Pins Address Bit 5
.equ	PINA6	= 6 ; Port A Input Pins Address Bit 6
.equ	PINA7	= 7 ; Port A Input Pins Address Bit 7


; ***** PORTB *****************
; PORTB - Port B Data Register
.equ	PORTB0	= 0 ; Port B Data Register Bit 0
.equ	PORTB1	= 1 ; Port B Data Register Bit 1
.equ	PORTB2	= 2 ; Port B Data Register Bit 2
.equ	PORTB3	= 3 ; Port B Data Register Bit 3
.equ	PORTB4	= 4 ; Port B Data Register Bit 4
.equ	PORTB5	= 5 ; Port B Data Register Bit 5
.equ	PORTB6	= 6 ; Port B Data Register Bit 6
.equ	PORTB7	= 7 ; Port B Data Register Bit 7

; DDRB - Port B Data Direction Register
.equ	DDRB0	= 0 ; Port B Data Direction Register Bit 0
.equ	DDRB1	= 1 ; Port B Data Direction Register Bit 1
.equ	DDRB2	= 2 ; Port B Data Direction Register Bit 2
.equ	DDRB3	= 3 ; Port B Data Direction Register Bit 3
.equ	DDRB4	= 4 ; Port B Data Direction Register Bit 4
.equ	DDRB5	= 5 ; Port B Data Direction Register Bit 5
.equ	DDRB6	= 6 ; Port B Data Direction Register Bit 6
.equ	DDRB7	= 7 ; Port B Data Direction Register Bit 7

; PINB - Port B Input Pins Address
.equ	PINB0	= 0 ; Port B Input Pins Address Bit 0
.equ	PINB1	= 1 ; Port B Input Pins Address Bit 1
.equ	PINB2	= 2 ; Port B Input Pins Address Bit 2
.equ	PINB3	= 3 ; Port B Input Pins Address Bit 3
.equ	PINB4	= 4 ; Port B Input Pins Address Bit 4
.equ	PINB5	= 5 ; Port B Input Pins Address Bit 5
.equ	PINB6	= 6 ; Port B Input Pins Address Bit 6
.equ	PINB7	= 7 ; Port B Input Pins Address Bit 7


; ***** PORTC *****************
; PORTC - Port C Data Register
.equ	PORTC0	= 0 ; Port C Data Register Bit 0
.equ	PORTC1	= 1 ; Port C Data Register Bit 1
.equ	PORTC2	= 2 ; Port C Data Register Bit 2
.equ	PORTC3	= 3 ; Port C Data Register Bit 3
.equ	PORTC4	= 4 ; Port C Data Register Bit 4
.equ	PORTC5	= 5 ; Port C Data Register Bit 5
.equ	PORTC6	= 6 ; Port C Data Register Bit 6
.equ	PORTC7	= 7 ; Port C Data Register Bit 7

; DDRC - Port C Data Direction Register
.equ	DDRC0	= 0 ; Port C Data Direction Register Bit 0
.equ	DDRC1	= 1 ; Port C Data Direction Register Bit 1
.equ	DDRC2	= 2 ; Port C Data Direction Register Bit 2
.equ	DDRC3	= 3 ; Port C Data Direction Register Bit 3
.equ	DDRC4	= 4 ; Port C Data Direction Register Bit 4
.equ	DDRC5	= 5 ; Port C Data Direction Register Bit 5
.equ	DDRC6	= 6 ; Port C Data Direction Register Bit 6
.equ	DDRC7	= 7 ; Port C Data Direction Register Bit 7

; PINC - Port C Input Pins Address
.equ	PINC0	= 0 ; Port C Input Pins Address Bit 0
.equ	PINC1	= 1 ; Port C Input Pins Address Bit 1
.equ	PINC2	= 2 ; Port C Input Pins Address Bit 2
.equ	PINC3	= 3 ; Port C Input Pins Address Bit 3
.equ	PINC4	= 4 ; Port C Input Pins Address Bit 4
.equ	PINC5	= 5 ; Port C Input Pins Address Bit 5
.equ	PINC6	= 6 ; Port C Input Pins Address Bit 6
.equ	PINC7	= 7 ; Port C Input Pins Address Bit 7


; ***** PORTD *****************
; PORTD - Port D Data Register
.equ	PORTD0	= 0 ; Port D Data Register Bit 0
.equ	PORTD1	= 1 ; Port D Data Register Bit 1
.equ	PORTD2	= 2 ; Port D Data Register Bit 2
.equ	PORTD3	= 3 ; Port D Data Register Bit 3
.equ	PORTD4	= 4 ; Port D Data Register Bit 4
.equ	PORTD5	= 5 ; Port D Data Register Bit 5
.equ	PORTD6	= 6 ; Port D Data Register Bit 6
.equ	PORTD7	= 7 ; Port D Data Register Bit 7

; DDRD - Port D Data Direction Register
.equ	DDRD0	= 0 ; Port D Data Direction Register Bit 0
.equ	DDRD1	= 1 ; Port D Data Direction Register Bit 1
.equ	DDRD2	= 2 ; Port D Data Direction Register Bit 2
.equ	DDRD3	= 3 ; Port D Data Direction Register Bit 3
.equ	DDRD4	= 4 ; Port D Data Direction Register Bit 4
.equ	DDRD5	= 5 ; Port D Data Direction Register Bit 5
.equ	DDRD6	= 6 ; Port D Data Direction Register Bit 6
.equ	DDRD7	= 7 ; Port D Data Direction Register Bit 7

; PIND - Port D Input Pins Address
.equ	PIND0	= 0 ; Port D Input Pins Address Bit 0
.equ	PIND1	= 1 ; Port D Input Pins Address Bit 1
.equ	PIND2	= 2 ; Port D Input Pins Address Bit 2
.equ	PIND3	= 3 ; Port D Input Pins Address Bit 3
.equ	PIND4	= 4 ; Port D Input Pins Address Bit 4
.equ	PIND5	= 5 ; Port D Input Pins Address Bit 5
.equ	PIND6	= 6 ; Port D Input Pins Address Bit 6
.equ	PIND7	= 7 ; Port D Input Pins Address Bit 7


; ***** PORTE *****************
; PORTE - Port E Data Register
.equ	PORTE0	= 0 ; Port E Data Register Bit 0
.equ	PORTE1	= 1 ; Port E Data Register Bit 1
.equ	PORTE2	= 2 ; Port E Data Register Bit 2
.equ	PORTE3	= 3 ; Port E Data Register Bit 3
.equ	PORTE4	= 4 ; Port E Data Register Bit 4
.equ	PORTE5	= 5 ; Port E Data Register Bit 5
.equ	PORTE6	= 6 ; Port E Data Register Bit 6
.equ	PORTE7	= 7 ; Port E Data Register Bit 7

; DDRE - Port E Data Direction Register
.equ	DDRE0	= 0 ; Port E Data Direction Register Bit 0
.equ	DDRE1	= 1 ; Port E Data Direction Register Bit 1
.equ	DDRE2	= 2 ; Port E Data Direction Register Bit 2
.equ	DDRE3	= 3 ; Port E Data Direction Register Bit 3
.equ	DDRE4	= 4 ; Port E Data Direction Register Bit 4
.equ	DDRE5	= 5 ; Port E Data Direction Register Bit 5
.equ	DDRE6	= 6 ; Port E Data Direction Register Bit 6
.equ	DDRE7	= 7 ; Port E Data Direction Register Bit 7

; PINE - Port E Input Pins Address
.equ	PINE0	= 0 ; Port E Input Pins Address Bit 0
.equ	PINE1	= 1 ; Port E Input Pins Address Bit 1
.equ	PINE2	= 2 ; Port E Input Pins Address Bit 2
.equ	PINE3	= 3 ; Port E Input Pins Address Bit 3
.equ	PINE4	= 4 ; Port E Input Pins Address Bit 4
.equ	PINE5	= 5 ; Port E Input Pins Address Bit 5
.equ	PINE6	= 6 ; Port E Input Pins Address Bit 6
.equ	PINE7	= 7 ; Port E Input Pins Address Bit 7


