trol73/avr-make/asm/include/m2564RFR2def.inc
; ***** PORTF *****************
; PORTF - Port F Data Register
.equ	PORTF0	= 0 ; Port F Data Register Bit 0
.equ	PORTF1	= 1 ; Port F Data Register Bit 1
.equ	PORTF2	= 2 ; Port F Data Register Bit 2
.equ	PORTF3	= 3 ; Port F Data Register Bit 3
.equ	PORTF4	= 4 ; Port F Data Register Bit 4
.equ	PORTF5	= 5 ; Port F Data Register Bit 5
.equ	PORTF6	= 6 ; Port F Data Register Bit 6
.equ	PORTF7	= 7 ; Port F Data Register Bit 7

; DDRF - Port F Data Direction Register
.equ	DDRF0	= 0 ; Port F Data Direction Register Bit 0
.equ	DDRF1	= 1 ; Port F Data Direction Register Bit 1
.equ	DDRF2	= 2 ; Port F Data Direction Register Bit 2
.equ	DDRF3	= 3 ; Port F Data Direction Register Bit 3
.equ	DDRF4	= 4 ; Port F Data Direction Register Bit 4
.equ	DDRF5	= 5 ; Port F Data Direction Register Bit 5
.equ	DDRF6	= 6 ; Port F Data Direction Register Bit 6
.equ	DDRF7	= 7 ; Port F Data Direction Register Bit 7

; PINF - Port F Input Pins Address
.equ	PINF0	= 0 ; Port F Input Pins Address Bit 0
.equ	PINF1	= 1 ; Port F Input Pins Address Bit 1
.equ	PINF2	= 2 ; Port F Input Pins Address Bit 2
.equ	PINF3	= 3 ; Port F Input Pins Address Bit 3
.equ	PINF4	= 4 ; Port F Input Pins Address Bit 4
.equ	PINF5	= 5 ; Port F Input Pins Address Bit 5
.equ	PINF6	= 6 ; Port F Input Pins Address Bit 6
.equ	PINF7	= 7 ; Port F Input Pins Address Bit 7


; ***** PORTG *****************
; PORTG - Port G Data Register
.equ	PORTG0	= 0 ; Port G Data Register Bit 0
.equ	PORTG1	= 1 ; Port G Data Register Bit 1
.equ	PORTG2	= 2 ; Port G Data Register Bit 2
.equ	PORTG3	= 3 ; Port G Data Register Bit 3
.equ	PORTG4	= 4 ; Port G Data Register Bit 4
.equ	PORTG5	= 5 ; Port G Data Register Bit 5
.equ	PORTG6	= 6 ; Port G Data Register Bit 6
.equ	PORTG7	= 7 ; Port G Data Register Bit 7

; DDRG - Port G Data Direction Register
.equ	DDRG0	= 0 ; Port G Data Direction Register Bit 0
.equ	DDRG1	= 1 ; Port G Data Direction Register Bit 1
.equ	DDRG2	= 2 ; Port G Data Direction Register Bit 2
.equ	DDRG3	= 3 ; Port G Data Direction Register Bit 3
.equ	DDRG4	= 4 ; Port G Data Direction Register Bit 4
.equ	DDRG5	= 5 ; Port G Data Direction Register Bit 5
.equ	DDRG6	= 6 ; Port G Data Direction Register Bit 6
.equ	DDRG7	= 7 ; Port G Data Direction Register Bit 7

; PING - Port G Input Pins Address
.equ	PING0	= 0 ; Port G Input Pins Address Bit 0
.equ	PING1	= 1 ; Port G Input Pins Address Bit 1
.equ	PING2	= 2 ; Port G Input Pins Address Bit 2
.equ	PING3	= 3 ; Port G Input Pins Address Bit 3
.equ	PING4	= 4 ; Port G Input Pins Address Bit 4
.equ	PING5	= 5 ; Port G Input Pins Address Bit 5
.equ	PING6	= 6 ; Port G Input Pins Address Bit 6
.equ	PING7	= 7 ; Port G Input Pins Address Bit 7


; ***** TIMER_COUNTER_0 *****************
; OCR0B - Timer/Counter0 Output Compare Register B
.equ	OCR0B0	= 0 ; Timer/Counter0 Output Compare Register B Bit 0
.equ	OCR0B1	= 1 ; Timer/Counter0 Output Compare Register B Bit 1
.equ	OCR0B2	= 2 ; Timer/Counter0 Output Compare Register B Bit 2
.equ	OCR0B3	= 3 ; Timer/Counter0 Output Compare Register B Bit 3
.equ	OCR0B4	= 4 ; Timer/Counter0 Output Compare Register B Bit 4
.equ	OCR0B5	= 5 ; Timer/Counter0 Output Compare Register B Bit 5
.equ	OCR0B6	= 6 ; Timer/Counter0 Output Compare Register B Bit 6
.equ	OCR0B7	= 7 ; Timer/Counter0 Output Compare Register B Bit 7

; OCR0A - Timer/Counter0 Output Compare Register
.equ	OCR0A0	= 0 ; Timer/Counter0 Output Compare Register Bit 0
.equ	OCR0A1	= 1 ; Timer/Counter0 Output Compare Register Bit 1
.equ	OCR0A2	= 2 ; Timer/Counter0 Output Compare Register Bit 2
.equ	OCR0A3	= 3 ; Timer/Counter0 Output Compare Register Bit 3
.equ	OCR0A4	= 4 ; Timer/Counter0 Output Compare Register Bit 4
.equ	OCR0A5	= 5 ; Timer/Counter0 Output Compare Register Bit 5
.equ	OCR0A6	= 6 ; Timer/Counter0 Output Compare Register Bit 6
.equ	OCR0A7	= 7 ; Timer/Counter0 Output Compare Register Bit 7

; TCNT0 - Timer/Counter0 Register
.equ	TCNT00	= 0 ; Timer/Counter0 Register Bit 0
.equ	TCNT01	= 1 ; Timer/Counter0 Register Bit 1
.equ	TCNT02	= 2 ; Timer/Counter0 Register Bit 2
.equ	TCNT03	= 3 ; Timer/Counter0 Register Bit 3
.equ	TCNT04	= 4 ; Timer/Counter0 Register Bit 4
.equ	TCNT05	= 5 ; Timer/Counter0 Register Bit 5
.equ	TCNT06	= 6 ; Timer/Counter0 Register Bit 6
.equ	TCNT07	= 7 ; Timer/Counter0 Register Bit 7

; TCCR0B - Timer/Counter0 Control Register B
.equ	CS00	= 0 ; Clock Select
.equ	CS01	= 1 ; Clock Select
.equ	CS02	= 2 ; Clock Select
.equ	WGM02	= 3 ; 
.equ	FOC0B	= 6 ; Force Output Compare B
.equ	FOC0A	= 7 ; Force Output Compare A

; TCCR0A - Timer/Counter0 Control Register A
.equ	WGM00	= 0 ; Waveform Generation Mode
.equ	WGM01	= 1 ; Waveform Generation Mode
.equ	COM0B0	= 4 ; Compare Match Output B Mode
.equ	COM0B1	= 5 ; Compare Match Output B Mode
.equ	COM0A0	= 6 ; Compare Match Output A Mode
.equ	COM0A1	= 7 ; Compare Match Output A Mode

; TIMSK0 - Timer/Counter0 Interrupt Mask Register
.equ	TOIE0	= 0 ; Timer/Counter0 Overflow Interrupt Enable
.equ	OCIE0A	= 1 ; Timer/Counter0 Output Compare Match A Interrupt Enable
.equ	OCIE0B	= 2 ; Timer/Counter0 Output Compare Match B Interrupt Enable

; TIFR0 - Timer/Counter0 Interrupt Flag Register
.equ	TOV0	= 0 ; Timer/Counter0 Overflow Flag
.equ	OCF0A	= 1 ; Timer/Counter0 Output Compare A Match Flag
.equ	OCF0B	= 2 ; Timer/Counter0 Output Compare B Match Flag

; GTCCR - General Timer/Counter Control Register
.equ	PSRSYNC	= 0 ; Prescaler Reset for Synchronous Timer/Counters
.equ	PSRASY	= 1 ; Prescaler Reset Timer/Counter2
.equ	TSM	= 7 ; Timer/Counter Synchronization Mode


; ***** TIMER_COUNTER_2 *****************
; TIMSK2 - Timer/Counter Interrupt Mask register
.equ	TOIE2	= 0 ; Timer/Counter2 Overflow Interrupt Enable
.equ	OCIE2A	= 1 ; Timer/Counter2 Output Compare Match A Interrupt Enable
.equ	OCIE2B	= 2 ; Timer/Counter2 Output Compare Match B Interrupt Enable

; TIFR2 - Timer/Counter Interrupt Flag Register
.equ	TOV2	= 0 ; Timer/Counter2 Overflow Flag
.equ	OCF2A	= 1 ; Output Compare Flag 2 A
.equ	OCF2B	= 2 ; Output Compare Flag 2 B

; TCCR2A - Timer/Counter2 Control Register A
.equ	WGM20	= 0 ; Waveform Generation Mode
.equ	WGM21	= 1 ; Waveform Generation Mode
.equ	COM2B0	= 4 ; Compare Match Output B Mode
.equ	COM2B1	= 5 ; Compare Match Output B Mode
.equ	COM2A0	= 6 ; Compare Match Output A Mode
.equ	COM2A1	= 7 ; Compare Match Output A Mode

