trol73/avr-make/asm/include/m2564RFR2def.inc
; TCCR2B - Timer/Counter2 Control Register B
.equ	CS20	= 0 ; Clock Select
.equ	CS21	= 1 ; Clock Select
.equ	CS22	= 2 ; Clock Select
.equ	WGM22	= 3 ; Waveform Generation Mode
.equ	FOC2B	= 6 ; Force Output Compare B
.equ	FOC2A	= 7 ; Force Output Compare A

; TCNT2 - Timer/Counter2
.equ	TCNT20	= 0 ; Timer/Counter2 Bit 0
.equ	TCNT21	= 1 ; Timer/Counter2 Bit 1
.equ	TCNT22	= 2 ; Timer/Counter2 Bit 2
.equ	TCNT23	= 3 ; Timer/Counter2 Bit 3
.equ	TCNT24	= 4 ; Timer/Counter2 Bit 4
.equ	TCNT25	= 5 ; Timer/Counter2 Bit 5
.equ	TCNT26	= 6 ; Timer/Counter2 Bit 6
.equ	TCNT27	= 7 ; Timer/Counter2 Bit 7

; OCR2B - Timer/Counter2 Output Compare Register B
.equ	OCR2B0	= 0 ; Timer/Counter2 Output Compare Register B Bit 0
.equ	OCR2B1	= 1 ; Timer/Counter2 Output Compare Register B Bit 1
.equ	OCR2B2	= 2 ; Timer/Counter2 Output Compare Register B Bit 2
.equ	OCR2B3	= 3 ; Timer/Counter2 Output Compare Register B Bit 3
.equ	OCR2B4	= 4 ; Timer/Counter2 Output Compare Register B Bit 4
.equ	OCR2B5	= 5 ; Timer/Counter2 Output Compare Register B Bit 5
.equ	OCR2B6	= 6 ; Timer/Counter2 Output Compare Register B Bit 6
.equ	OCR2B7	= 7 ; Timer/Counter2 Output Compare Register B Bit 7

; OCR2A - Timer/Counter2 Output Compare Register A
.equ	OCR2A0	= 0 ; Timer/Counter2 Output Compare Register A Bit 0
.equ	OCR2A1	= 1 ; Timer/Counter2 Output Compare Register A Bit 1
.equ	OCR2A2	= 2 ; Timer/Counter2 Output Compare Register A Bit 2
.equ	OCR2A3	= 3 ; Timer/Counter2 Output Compare Register A Bit 3
.equ	OCR2A4	= 4 ; Timer/Counter2 Output Compare Register A Bit 4
.equ	OCR2A5	= 5 ; Timer/Counter2 Output Compare Register A Bit 5
.equ	OCR2A6	= 6 ; Timer/Counter2 Output Compare Register A Bit 6
.equ	OCR2A7	= 7 ; Timer/Counter2 Output Compare Register A Bit 7

; ASSR - Asynchronous Status Register
.equ	TCR2BUB	= 0 ; Timer/Counter2 Control Register B Update Busy
.equ	TCR2AUB	= 1 ; Timer/Counter2 Control Register A Update Busy
.equ	OCR2BUB	= 2 ; Timer/Counter2 Output Compare Register B Update Busy
.equ	OCR2AUB	= 3 ; Timer/Counter2 Output Compare Register A Update Busy
.equ	TCN2UB	= 4 ; Timer/Counter2 Update Busy
.equ	AS2	= 5 ; Timer/Counter2 Asynchronous Mode
.equ	EXCLK	= 6 ; Enable External Clock Input
.equ	EXCLKAMR	= 7 ; Enable External Clock Input for AMR

; GTCCR - General Timer Counter Control register


; ***** WATCHDOG *****************
; WDTCSR - Watchdog Timer Control Register
.equ	WDE	= 3 ; Watch Dog Enable
.equ	WDCE	= 4 ; Watchdog Change Enable
.equ	WDP0	= 0 ; Watchdog Timer Prescaler Bits
.equ	WDP1	= 1 ; Watchdog Timer Prescaler Bits
.equ	WDP2	= 2 ; Watchdog Timer Prescaler Bits
.equ	WDP3	= 5 ; Watchdog Timer Prescaler Bits
.equ	WDIE	= 6 ; Watchdog Timeout Interrupt Enable
.equ	WDIF	= 7 ; Watchdog Timeout Interrupt Flag


; ***** TIMER_COUNTER_5 *****************
; TCCR5A - Timer/Counter5 Control Register A
.equ	WGM50	= 0 ; Waveform Generation Mode
.equ	WGM51	= 1 ; Waveform Generation Mode
.equ	COM5C0	= 2 ; Compare Output Mode for Channel C
.equ	COM5C1	= 3 ; Compare Output Mode for Channel C
.equ	COM5B0	= 4 ; Compare Output Mode for Channel B
.equ	COM5B1	= 5 ; Compare Output Mode for Channel B
.equ	COM5A0	= 6 ; Compare Output Mode for Channel A
.equ	COM5A1	= 7 ; Compare Output Mode for Channel A

; TCCR5B - Timer/Counter5 Control Register B
.equ	CS50	= 0 ; Clock Select
.equ	CS51	= 1 ; Clock Select
.equ	CS52	= 2 ; Clock Select
.equ	WGM52	= 3 ; Waveform Generation Mode
.equ	WGM53	= 4 ; Waveform Generation Mode
.equ	ICES5	= 6 ; Input Capture 5 Edge Select
.equ	ICNC5	= 7 ; Input Capture 5 Noise Canceller

; TCCR5C - Timer/Counter5 Control Register C
.equ	FOC5C	= 5 ; Force Output Compare for Channel C
.equ	FOC5B	= 6 ; Force Output Compare for Channel B
.equ	FOC5A	= 7 ; Force Output Compare for Channel A

; TCNT5 - Timer/Counter5  Bytes
.equ	TCNT5H0	= 0 ; Timer/Counter5  Bytes High Bit 8
.equ	TCNT5H1	= 1 ; Timer/Counter5  Bytes High Bit 9
.equ	TCNT5H2	= 2 ; Timer/Counter5  Bytes High Bit 10
.equ	TCNT5H3	= 3 ; Timer/Counter5  Bytes High Bit 11
.equ	TCNT5H4	= 4 ; Timer/Counter5  Bytes High Bit 12
.equ	TCNT5H5	= 5 ; Timer/Counter5  Bytes High Bit 13
.equ	TCNT5H6	= 6 ; Timer/Counter5  Bytes High Bit 14
.equ	TCNT5H7	= 7 ; Timer/Counter5  Bytes High Bit 15

.equ	TCNT5L0	= 0 ; Timer/Counter5  Bytes Low Bit 0
.equ	TCNT5L1	= 1 ; Timer/Counter5  Bytes Low Bit 1
.equ	TCNT5L2	= 2 ; Timer/Counter5  Bytes Low Bit 2
.equ	TCNT5L3	= 3 ; Timer/Counter5  Bytes Low Bit 3
.equ	TCNT5L4	= 4 ; Timer/Counter5  Bytes Low Bit 4
.equ	TCNT5L5	= 5 ; Timer/Counter5  Bytes Low Bit 5
.equ	TCNT5L6	= 6 ; Timer/Counter5  Bytes Low Bit 6
.equ	TCNT5L7	= 7 ; Timer/Counter5  Bytes Low Bit 7

; OCR5A - Timer/Counter5 Output Compare Register A  Bytes
.equ	OCR5AH0	= 0 ; Timer/Counter5 Output Compare Register A  Bytes High Bit 8
.equ	OCR5AH1	= 1 ; Timer/Counter5 Output Compare Register A  Bytes High Bit 9
.equ	OCR5AH2	= 2 ; Timer/Counter5 Output Compare Register A  Bytes High Bit 10
.equ	OCR5AH3	= 3 ; Timer/Counter5 Output Compare Register A  Bytes High Bit 11
.equ	OCR5AH4	= 4 ; Timer/Counter5 Output Compare Register A  Bytes High Bit 12
.equ	OCR5AH5	= 5 ; Timer/Counter5 Output Compare Register A  Bytes High Bit 13
.equ	OCR5AH6	= 6 ; Timer/Counter5 Output Compare Register A  Bytes High Bit 14
.equ	OCR5AH7	= 7 ; Timer/Counter5 Output Compare Register A  Bytes High Bit 15

.equ	OCR5AL0	= 0 ; Timer/Counter5 Output Compare Register A  Bytes Low Bit 0
.equ	OCR5AL1	= 1 ; Timer/Counter5 Output Compare Register A  Bytes Low Bit 1
.equ	OCR5AL2	= 2 ; Timer/Counter5 Output Compare Register A  Bytes Low Bit 2
.equ	OCR5AL3	= 3 ; Timer/Counter5 Output Compare Register A  Bytes Low Bit 3
.equ	OCR5AL4	= 4 ; Timer/Counter5 Output Compare Register A  Bytes Low Bit 4
.equ	OCR5AL5	= 5 ; Timer/Counter5 Output Compare Register A  Bytes Low Bit 5
.equ	OCR5AL6	= 6 ; Timer/Counter5 Output Compare Register A  Bytes Low Bit 6
.equ	OCR5AL7	= 7 ; Timer/Counter5 Output Compare Register A  Bytes Low Bit 7

; OCR5B - Timer/Counter5 Output Compare Register B  Bytes
.equ	OCR5BH0	= 0 ; Timer/Counter5 Output Compare Register B  Bytes High Bit 8
.equ	OCR5BH1	= 1 ; Timer/Counter5 Output Compare Register B  Bytes High Bit 9
.equ	OCR5BH2	= 2 ; Timer/Counter5 Output Compare Register B  Bytes High Bit 10
.equ	OCR5BH3	= 3 ; Timer/Counter5 Output Compare Register B  Bytes High Bit 11
.equ	OCR5BH4	= 4 ; Timer/Counter5 Output Compare Register B  Bytes High Bit 12
.equ	OCR5BH5	= 5 ; Timer/Counter5 Output Compare Register B  Bytes High Bit 13
.equ	OCR5BH6	= 6 ; Timer/Counter5 Output Compare Register B  Bytes High Bit 14
.equ	OCR5BH7	= 7 ; Timer/Counter5 Output Compare Register B  Bytes High Bit 15

.equ	OCR5BL0	= 0 ; Timer/Counter5 Output Compare Register B  Bytes Low Bit 0
.equ	OCR5BL1	= 1 ; Timer/Counter5 Output Compare Register B  Bytes Low Bit 1
.equ	OCR5BL2	= 2 ; Timer/Counter5 Output Compare Register B  Bytes Low Bit 2
.equ	OCR5BL3	= 3 ; Timer/Counter5 Output Compare Register B  Bytes Low Bit 3
.equ	OCR5BL4	= 4 ; Timer/Counter5 Output Compare Register B  Bytes Low Bit 4
.equ	OCR5BL5	= 5 ; Timer/Counter5 Output Compare Register B  Bytes Low Bit 5
.equ	OCR5BL6	= 6 ; Timer/Counter5 Output Compare Register B  Bytes Low Bit 6
.equ	OCR5BL7	= 7 ; Timer/Counter5 Output Compare Register B  Bytes Low Bit 7

