trol73/avr-make/asm/include/m2564RFR2def.inc
; OCR5C - Timer/Counter5 Output Compare Register C  Bytes
.equ	OCR5CH0	= 0 ; Timer/Counter5 Output Compare Register C  Bytes High Bit 8
.equ	OCR5CH1	= 1 ; Timer/Counter5 Output Compare Register C  Bytes High Bit 9
.equ	OCR5CH2	= 2 ; Timer/Counter5 Output Compare Register C  Bytes High Bit 10
.equ	OCR5CH3	= 3 ; Timer/Counter5 Output Compare Register C  Bytes High Bit 11
.equ	OCR5CH4	= 4 ; Timer/Counter5 Output Compare Register C  Bytes High Bit 12
.equ	OCR5CH5	= 5 ; Timer/Counter5 Output Compare Register C  Bytes High Bit 13
.equ	OCR5CH6	= 6 ; Timer/Counter5 Output Compare Register C  Bytes High Bit 14
.equ	OCR5CH7	= 7 ; Timer/Counter5 Output Compare Register C  Bytes High Bit 15

.equ	OCR5CL0	= 0 ; Timer/Counter5 Output Compare Register C  Bytes Low Bit 0
.equ	OCR5CL1	= 1 ; Timer/Counter5 Output Compare Register C  Bytes Low Bit 1
.equ	OCR5CL2	= 2 ; Timer/Counter5 Output Compare Register C  Bytes Low Bit 2
.equ	OCR5CL3	= 3 ; Timer/Counter5 Output Compare Register C  Bytes Low Bit 3
.equ	OCR5CL4	= 4 ; Timer/Counter5 Output Compare Register C  Bytes Low Bit 4
.equ	OCR5CL5	= 5 ; Timer/Counter5 Output Compare Register C  Bytes Low Bit 5
.equ	OCR5CL6	= 6 ; Timer/Counter5 Output Compare Register C  Bytes Low Bit 6
.equ	OCR5CL7	= 7 ; Timer/Counter5 Output Compare Register C  Bytes Low Bit 7

; ICR5 - Timer/Counter5 Input Capture Register  Bytes
.equ	ICR5H0	= 0 ; Timer/Counter5 Input Capture Register  Bytes High Bit 8
.equ	ICR5H1	= 1 ; Timer/Counter5 Input Capture Register  Bytes High Bit 9
.equ	ICR5H2	= 2 ; Timer/Counter5 Input Capture Register  Bytes High Bit 10
.equ	ICR5H3	= 3 ; Timer/Counter5 Input Capture Register  Bytes High Bit 11
.equ	ICR5H4	= 4 ; Timer/Counter5 Input Capture Register  Bytes High Bit 12
.equ	ICR5H5	= 5 ; Timer/Counter5 Input Capture Register  Bytes High Bit 13
.equ	ICR5H6	= 6 ; Timer/Counter5 Input Capture Register  Bytes High Bit 14
.equ	ICR5H7	= 7 ; Timer/Counter5 Input Capture Register  Bytes High Bit 15

.equ	ICR5L0	= 0 ; Timer/Counter5 Input Capture Register  Bytes Low Bit 0
.equ	ICR5L1	= 1 ; Timer/Counter5 Input Capture Register  Bytes Low Bit 1
.equ	ICR5L2	= 2 ; Timer/Counter5 Input Capture Register  Bytes Low Bit 2
.equ	ICR5L3	= 3 ; Timer/Counter5 Input Capture Register  Bytes Low Bit 3
.equ	ICR5L4	= 4 ; Timer/Counter5 Input Capture Register  Bytes Low Bit 4
.equ	ICR5L5	= 5 ; Timer/Counter5 Input Capture Register  Bytes Low Bit 5
.equ	ICR5L6	= 6 ; Timer/Counter5 Input Capture Register  Bytes Low Bit 6
.equ	ICR5L7	= 7 ; Timer/Counter5 Input Capture Register  Bytes Low Bit 7

; TIMSK5 - Timer/Counter5 Interrupt Mask Register
.equ	TOIE5	= 0 ; Timer/Counter5 Overflow Interrupt Enable
.equ	OCIE5A	= 1 ; Timer/Counter5 Output Compare A Match Interrupt Enable
.equ	OCIE5B	= 2 ; Timer/Counter5 Output Compare B Match Interrupt Enable
.equ	OCIE5C	= 3 ; Timer/Counter5 Output Compare C Match Interrupt Enable
.equ	ICIE5	= 5 ; Timer/Counter5 Input Capture Interrupt Enable

; TIFR5 - Timer/Counter5 Interrupt Flag Register
.equ	TOV5	= 0 ; Timer/Counter5 Overflow Flag
.equ	OCF5A	= 1 ; Timer/Counter5 Output Compare A Match Flag
.equ	OCF5B	= 2 ; Timer/Counter5 Output Compare B Match Flag
.equ	OCF5C	= 3 ; Timer/Counter5 Output Compare C Match Flag
.equ	ICF5	= 5 ; Timer/Counter5 Input Capture Flag


; ***** TIMER_COUNTER_4 *****************
; TCCR4A - Timer/Counter4 Control Register A
.equ	WGM40	= 0 ; Waveform Generation Mode
.equ	WGM41	= 1 ; Waveform Generation Mode
.equ	COM4C0	= 2 ; Compare Output Mode for Channel C
.equ	COM4C1	= 3 ; Compare Output Mode for Channel C
.equ	COM4B0	= 4 ; Compare Output Mode for Channel B
.equ	COM4B1	= 5 ; Compare Output Mode for Channel B
.equ	COM4A0	= 6 ; Compare Output Mode for Channel A
.equ	COM4A1	= 7 ; Compare Output Mode for Channel A

; TCCR4B - Timer/Counter4 Control Register B
.equ	CS40	= 0 ; Clock Select
.equ	CS41	= 1 ; Clock Select
.equ	CS42	= 2 ; Clock Select
.equ	WGM42	= 3 ; Waveform Generation Mode
.equ	WGM43	= 4 ; Waveform Generation Mode
.equ	ICES4	= 6 ; Input Capture 4 Edge Select
.equ	ICNC4	= 7 ; Input Capture 4 Noise Canceller

; TCCR4C - Timer/Counter4 Control Register C
.equ	FOC4C	= 5 ; Force Output Compare for Channel C
.equ	FOC4B	= 6 ; Force Output Compare for Channel B
.equ	FOC4A	= 7 ; Force Output Compare for Channel A

; TCNT4 - Timer/Counter4  Bytes
.equ	TCNT4H0	= 0 ; Timer/Counter4  Bytes High Bit 8
.equ	TCNT4H1	= 1 ; Timer/Counter4  Bytes High Bit 9
.equ	TCNT4H2	= 2 ; Timer/Counter4  Bytes High Bit 10
.equ	TCNT4H3	= 3 ; Timer/Counter4  Bytes High Bit 11
.equ	TCNT4H4	= 4 ; Timer/Counter4  Bytes High Bit 12
.equ	TCNT4H5	= 5 ; Timer/Counter4  Bytes High Bit 13
.equ	TCNT4H6	= 6 ; Timer/Counter4  Bytes High Bit 14
.equ	TCNT4H7	= 7 ; Timer/Counter4  Bytes High Bit 15

.equ	TCNT4L0	= 0 ; Timer/Counter4  Bytes Low Bit 0
.equ	TCNT4L1	= 1 ; Timer/Counter4  Bytes Low Bit 1
.equ	TCNT4L2	= 2 ; Timer/Counter4  Bytes Low Bit 2
.equ	TCNT4L3	= 3 ; Timer/Counter4  Bytes Low Bit 3
.equ	TCNT4L4	= 4 ; Timer/Counter4  Bytes Low Bit 4
.equ	TCNT4L5	= 5 ; Timer/Counter4  Bytes Low Bit 5
.equ	TCNT4L6	= 6 ; Timer/Counter4  Bytes Low Bit 6
.equ	TCNT4L7	= 7 ; Timer/Counter4  Bytes Low Bit 7

; OCR4A - Timer/Counter4 Output Compare Register A  Bytes
.equ	OCR4AH0	= 0 ; Timer/Counter4 Output Compare Register A  Bytes High Bit 8
.equ	OCR4AH1	= 1 ; Timer/Counter4 Output Compare Register A  Bytes High Bit 9
.equ	OCR4AH2	= 2 ; Timer/Counter4 Output Compare Register A  Bytes High Bit 10
.equ	OCR4AH3	= 3 ; Timer/Counter4 Output Compare Register A  Bytes High Bit 11
.equ	OCR4AH4	= 4 ; Timer/Counter4 Output Compare Register A  Bytes High Bit 12
.equ	OCR4AH5	= 5 ; Timer/Counter4 Output Compare Register A  Bytes High Bit 13
.equ	OCR4AH6	= 6 ; Timer/Counter4 Output Compare Register A  Bytes High Bit 14
.equ	OCR4AH7	= 7 ; Timer/Counter4 Output Compare Register A  Bytes High Bit 15

.equ	OCR4AL0	= 0 ; Timer/Counter4 Output Compare Register A  Bytes Low Bit 0
.equ	OCR4AL1	= 1 ; Timer/Counter4 Output Compare Register A  Bytes Low Bit 1
.equ	OCR4AL2	= 2 ; Timer/Counter4 Output Compare Register A  Bytes Low Bit 2
.equ	OCR4AL3	= 3 ; Timer/Counter4 Output Compare Register A  Bytes Low Bit 3
.equ	OCR4AL4	= 4 ; Timer/Counter4 Output Compare Register A  Bytes Low Bit 4
.equ	OCR4AL5	= 5 ; Timer/Counter4 Output Compare Register A  Bytes Low Bit 5
.equ	OCR4AL6	= 6 ; Timer/Counter4 Output Compare Register A  Bytes Low Bit 6
.equ	OCR4AL7	= 7 ; Timer/Counter4 Output Compare Register A  Bytes Low Bit 7

; OCR4B - Timer/Counter4 Output Compare Register B  Bytes
.equ	OCR4BH0	= 0 ; Timer/Counter4 Output Compare Register B  Bytes High Bit 8
.equ	OCR4BH1	= 1 ; Timer/Counter4 Output Compare Register B  Bytes High Bit 9
.equ	OCR4BH2	= 2 ; Timer/Counter4 Output Compare Register B  Bytes High Bit 10
.equ	OCR4BH3	= 3 ; Timer/Counter4 Output Compare Register B  Bytes High Bit 11
.equ	OCR4BH4	= 4 ; Timer/Counter4 Output Compare Register B  Bytes High Bit 12
.equ	OCR4BH5	= 5 ; Timer/Counter4 Output Compare Register B  Bytes High Bit 13
.equ	OCR4BH6	= 6 ; Timer/Counter4 Output Compare Register B  Bytes High Bit 14
.equ	OCR4BH7	= 7 ; Timer/Counter4 Output Compare Register B  Bytes High Bit 15

.equ	OCR4BL0	= 0 ; Timer/Counter4 Output Compare Register B  Bytes Low Bit 0
.equ	OCR4BL1	= 1 ; Timer/Counter4 Output Compare Register B  Bytes Low Bit 1
.equ	OCR4BL2	= 2 ; Timer/Counter4 Output Compare Register B  Bytes Low Bit 2
.equ	OCR4BL3	= 3 ; Timer/Counter4 Output Compare Register B  Bytes Low Bit 3
.equ	OCR4BL4	= 4 ; Timer/Counter4 Output Compare Register B  Bytes Low Bit 4
.equ	OCR4BL5	= 5 ; Timer/Counter4 Output Compare Register B  Bytes Low Bit 5
.equ	OCR4BL6	= 6 ; Timer/Counter4 Output Compare Register B  Bytes Low Bit 6
.equ	OCR4BL7	= 7 ; Timer/Counter4 Output Compare Register B  Bytes Low Bit 7

; OCR4C - Timer/Counter4 Output Compare Register C  Bytes
.equ	OCR4CH0	= 0 ; Timer/Counter4 Output Compare Register C  Bytes High Bit 8
.equ	OCR4CH1	= 1 ; Timer/Counter4 Output Compare Register C  Bytes High Bit 9
.equ	OCR4CH2	= 2 ; Timer/Counter4 Output Compare Register C  Bytes High Bit 10
.equ	OCR4CH3	= 3 ; Timer/Counter4 Output Compare Register C  Bytes High Bit 11
.equ	OCR4CH4	= 4 ; Timer/Counter4 Output Compare Register C  Bytes High Bit 12
.equ	OCR4CH5	= 5 ; Timer/Counter4 Output Compare Register C  Bytes High Bit 13
.equ	OCR4CH6	= 6 ; Timer/Counter4 Output Compare Register C  Bytes High Bit 14
.equ	OCR4CH7	= 7 ; Timer/Counter4 Output Compare Register C  Bytes High Bit 15

