trol73/avr-make/asm/include/m2564RFR2def.inc
.equ	OCR4CL0	= 0 ; Timer/Counter4 Output Compare Register C  Bytes Low Bit 0
.equ	OCR4CL1	= 1 ; Timer/Counter4 Output Compare Register C  Bytes Low Bit 1
.equ	OCR4CL2	= 2 ; Timer/Counter4 Output Compare Register C  Bytes Low Bit 2
.equ	OCR4CL3	= 3 ; Timer/Counter4 Output Compare Register C  Bytes Low Bit 3
.equ	OCR4CL4	= 4 ; Timer/Counter4 Output Compare Register C  Bytes Low Bit 4
.equ	OCR4CL5	= 5 ; Timer/Counter4 Output Compare Register C  Bytes Low Bit 5
.equ	OCR4CL6	= 6 ; Timer/Counter4 Output Compare Register C  Bytes Low Bit 6
.equ	OCR4CL7	= 7 ; Timer/Counter4 Output Compare Register C  Bytes Low Bit 7

; ICR4 - Timer/Counter4 Input Capture Register  Bytes
.equ	ICR4H0	= 0 ; Timer/Counter4 Input Capture Register  Bytes High Bit 8
.equ	ICR4H1	= 1 ; Timer/Counter4 Input Capture Register  Bytes High Bit 9
.equ	ICR4H2	= 2 ; Timer/Counter4 Input Capture Register  Bytes High Bit 10
.equ	ICR4H3	= 3 ; Timer/Counter4 Input Capture Register  Bytes High Bit 11
.equ	ICR4H4	= 4 ; Timer/Counter4 Input Capture Register  Bytes High Bit 12
.equ	ICR4H5	= 5 ; Timer/Counter4 Input Capture Register  Bytes High Bit 13
.equ	ICR4H6	= 6 ; Timer/Counter4 Input Capture Register  Bytes High Bit 14
.equ	ICR4H7	= 7 ; Timer/Counter4 Input Capture Register  Bytes High Bit 15

.equ	ICR4L0	= 0 ; Timer/Counter4 Input Capture Register  Bytes Low Bit 0
.equ	ICR4L1	= 1 ; Timer/Counter4 Input Capture Register  Bytes Low Bit 1
.equ	ICR4L2	= 2 ; Timer/Counter4 Input Capture Register  Bytes Low Bit 2
.equ	ICR4L3	= 3 ; Timer/Counter4 Input Capture Register  Bytes Low Bit 3
.equ	ICR4L4	= 4 ; Timer/Counter4 Input Capture Register  Bytes Low Bit 4
.equ	ICR4L5	= 5 ; Timer/Counter4 Input Capture Register  Bytes Low Bit 5
.equ	ICR4L6	= 6 ; Timer/Counter4 Input Capture Register  Bytes Low Bit 6
.equ	ICR4L7	= 7 ; Timer/Counter4 Input Capture Register  Bytes Low Bit 7

; TIMSK4 - Timer/Counter4 Interrupt Mask Register
.equ	TOIE4	= 0 ; Timer/Counter4 Overflow Interrupt Enable
.equ	OCIE4A	= 1 ; Timer/Counter4 Output Compare A Match Interrupt Enable
.equ	OCIE4B	= 2 ; Timer/Counter4 Output Compare B Match Interrupt Enable
.equ	OCIE4C	= 3 ; Timer/Counter4 Output Compare C Match Interrupt Enable
.equ	ICIE4	= 5 ; Timer/Counter4 Input Capture Interrupt Enable

; TIFR4 - Timer/Counter4 Interrupt Flag Register
.equ	TOV4	= 0 ; Timer/Counter4 Overflow Flag
.equ	OCF4A	= 1 ; Timer/Counter4 Output Compare A Match Flag
.equ	OCF4B	= 2 ; Timer/Counter4 Output Compare B Match Flag
.equ	OCF4C	= 3 ; Timer/Counter4 Output Compare C Match Flag
.equ	ICF4	= 5 ; Timer/Counter4 Input Capture Flag


; ***** TIMER_COUNTER_3 *****************
; TCCR3A - Timer/Counter3 Control Register A
.equ	WGM30	= 0 ; Waveform Generation Mode
.equ	WGM31	= 1 ; Waveform Generation Mode
.equ	COM3C0	= 2 ; Compare Output Mode for Channel C
.equ	COM3C1	= 3 ; Compare Output Mode for Channel C
.equ	COM3B0	= 4 ; Compare Output Mode for Channel B
.equ	COM3B1	= 5 ; Compare Output Mode for Channel B
.equ	COM3A0	= 6 ; Compare Output Mode for Channel A
.equ	COM3A1	= 7 ; Compare Output Mode for Channel A

; TCCR3B - Timer/Counter3 Control Register B
.equ	CS30	= 0 ; Clock Select
.equ	CS31	= 1 ; Clock Select
.equ	CS32	= 2 ; Clock Select
.equ	WGM32	= 3 ; Waveform Generation Mode
.equ	WGM33	= 4 ; Waveform Generation Mode
.equ	ICES3	= 6 ; Input Capture 3 Edge Select
.equ	ICNC3	= 7 ; Input Capture 3 Noise Canceller

; TCCR3C - Timer/Counter3 Control Register C
.equ	FOC3C	= 5 ; Force Output Compare for Channel C
.equ	FOC3B	= 6 ; Force Output Compare for Channel B
.equ	FOC3A	= 7 ; Force Output Compare for Channel A

; TCNT3 - Timer/Counter3  Bytes
.equ	TCNT3H0	= 0 ; Timer/Counter3  Bytes High Bit 8
.equ	TCNT3H1	= 1 ; Timer/Counter3  Bytes High Bit 9
.equ	TCNT3H2	= 2 ; Timer/Counter3  Bytes High Bit 10
.equ	TCNT3H3	= 3 ; Timer/Counter3  Bytes High Bit 11
.equ	TCNT3H4	= 4 ; Timer/Counter3  Bytes High Bit 12
.equ	TCNT3H5	= 5 ; Timer/Counter3  Bytes High Bit 13
.equ	TCNT3H6	= 6 ; Timer/Counter3  Bytes High Bit 14
.equ	TCNT3H7	= 7 ; Timer/Counter3  Bytes High Bit 15

.equ	TCNT3L0	= 0 ; Timer/Counter3  Bytes Low Bit 0
.equ	TCNT3L1	= 1 ; Timer/Counter3  Bytes Low Bit 1
.equ	TCNT3L2	= 2 ; Timer/Counter3  Bytes Low Bit 2
.equ	TCNT3L3	= 3 ; Timer/Counter3  Bytes Low Bit 3
.equ	TCNT3L4	= 4 ; Timer/Counter3  Bytes Low Bit 4
.equ	TCNT3L5	= 5 ; Timer/Counter3  Bytes Low Bit 5
.equ	TCNT3L6	= 6 ; Timer/Counter3  Bytes Low Bit 6
.equ	TCNT3L7	= 7 ; Timer/Counter3  Bytes Low Bit 7

; OCR3A - Timer/Counter3 Output Compare Register A  Bytes
.equ	OCR3AH0	= 0 ; Timer/Counter3 Output Compare Register A  Bytes High Bit 8
.equ	OCR3AH1	= 1 ; Timer/Counter3 Output Compare Register A  Bytes High Bit 9
.equ	OCR3AH2	= 2 ; Timer/Counter3 Output Compare Register A  Bytes High Bit 10
.equ	OCR3AH3	= 3 ; Timer/Counter3 Output Compare Register A  Bytes High Bit 11
.equ	OCR3AH4	= 4 ; Timer/Counter3 Output Compare Register A  Bytes High Bit 12
.equ	OCR3AH5	= 5 ; Timer/Counter3 Output Compare Register A  Bytes High Bit 13
.equ	OCR3AH6	= 6 ; Timer/Counter3 Output Compare Register A  Bytes High Bit 14
.equ	OCR3AH7	= 7 ; Timer/Counter3 Output Compare Register A  Bytes High Bit 15

.equ	OCR3AL0	= 0 ; Timer/Counter3 Output Compare Register A  Bytes Low Bit 0
.equ	OCR3AL1	= 1 ; Timer/Counter3 Output Compare Register A  Bytes Low Bit 1
.equ	OCR3AL2	= 2 ; Timer/Counter3 Output Compare Register A  Bytes Low Bit 2
.equ	OCR3AL3	= 3 ; Timer/Counter3 Output Compare Register A  Bytes Low Bit 3
.equ	OCR3AL4	= 4 ; Timer/Counter3 Output Compare Register A  Bytes Low Bit 4
.equ	OCR3AL5	= 5 ; Timer/Counter3 Output Compare Register A  Bytes Low Bit 5
.equ	OCR3AL6	= 6 ; Timer/Counter3 Output Compare Register A  Bytes Low Bit 6
.equ	OCR3AL7	= 7 ; Timer/Counter3 Output Compare Register A  Bytes Low Bit 7

; OCR3B - Timer/Counter3 Output Compare Register B  Bytes
.equ	OCR3BH0	= 0 ; Timer/Counter3 Output Compare Register B  Bytes High Bit 8
.equ	OCR3BH1	= 1 ; Timer/Counter3 Output Compare Register B  Bytes High Bit 9
.equ	OCR3BH2	= 2 ; Timer/Counter3 Output Compare Register B  Bytes High Bit 10
.equ	OCR3BH3	= 3 ; Timer/Counter3 Output Compare Register B  Bytes High Bit 11
.equ	OCR3BH4	= 4 ; Timer/Counter3 Output Compare Register B  Bytes High Bit 12
.equ	OCR3BH5	= 5 ; Timer/Counter3 Output Compare Register B  Bytes High Bit 13
.equ	OCR3BH6	= 6 ; Timer/Counter3 Output Compare Register B  Bytes High Bit 14
.equ	OCR3BH7	= 7 ; Timer/Counter3 Output Compare Register B  Bytes High Bit 15

