trol73/avr-make/asm/include/m2564RFR2def.inc
.equ	OCR3BL0	= 0 ; Timer/Counter3 Output Compare Register B  Bytes Low Bit 0
.equ	OCR3BL1	= 1 ; Timer/Counter3 Output Compare Register B  Bytes Low Bit 1
.equ	OCR3BL2	= 2 ; Timer/Counter3 Output Compare Register B  Bytes Low Bit 2
.equ	OCR3BL3	= 3 ; Timer/Counter3 Output Compare Register B  Bytes Low Bit 3
.equ	OCR3BL4	= 4 ; Timer/Counter3 Output Compare Register B  Bytes Low Bit 4
.equ	OCR3BL5	= 5 ; Timer/Counter3 Output Compare Register B  Bytes Low Bit 5
.equ	OCR3BL6	= 6 ; Timer/Counter3 Output Compare Register B  Bytes Low Bit 6
.equ	OCR3BL7	= 7 ; Timer/Counter3 Output Compare Register B  Bytes Low Bit 7

; OCR3C - Timer/Counter3 Output Compare Register C  Bytes
.equ	OCR3CH0	= 0 ; Timer/Counter3 Output Compare Register C  Bytes High Bit 8
.equ	OCR3CH1	= 1 ; Timer/Counter3 Output Compare Register C  Bytes High Bit 9
.equ	OCR3CH2	= 2 ; Timer/Counter3 Output Compare Register C  Bytes High Bit 10
.equ	OCR3CH3	= 3 ; Timer/Counter3 Output Compare Register C  Bytes High Bit 11
.equ	OCR3CH4	= 4 ; Timer/Counter3 Output Compare Register C  Bytes High Bit 12
.equ	OCR3CH5	= 5 ; Timer/Counter3 Output Compare Register C  Bytes High Bit 13
.equ	OCR3CH6	= 6 ; Timer/Counter3 Output Compare Register C  Bytes High Bit 14
.equ	OCR3CH7	= 7 ; Timer/Counter3 Output Compare Register C  Bytes High Bit 15

.equ	OCR3CL0	= 0 ; Timer/Counter3 Output Compare Register C  Bytes Low Bit 0
.equ	OCR3CL1	= 1 ; Timer/Counter3 Output Compare Register C  Bytes Low Bit 1
.equ	OCR3CL2	= 2 ; Timer/Counter3 Output Compare Register C  Bytes Low Bit 2
.equ	OCR3CL3	= 3 ; Timer/Counter3 Output Compare Register C  Bytes Low Bit 3
.equ	OCR3CL4	= 4 ; Timer/Counter3 Output Compare Register C  Bytes Low Bit 4
.equ	OCR3CL5	= 5 ; Timer/Counter3 Output Compare Register C  Bytes Low Bit 5
.equ	OCR3CL6	= 6 ; Timer/Counter3 Output Compare Register C  Bytes Low Bit 6
.equ	OCR3CL7	= 7 ; Timer/Counter3 Output Compare Register C  Bytes Low Bit 7

; ICR3 - Timer/Counter3 Input Capture Register  Bytes
.equ	ICR3H0	= 0 ; Timer/Counter3 Input Capture Register  Bytes High Bit 8
.equ	ICR3H1	= 1 ; Timer/Counter3 Input Capture Register  Bytes High Bit 9
.equ	ICR3H2	= 2 ; Timer/Counter3 Input Capture Register  Bytes High Bit 10
.equ	ICR3H3	= 3 ; Timer/Counter3 Input Capture Register  Bytes High Bit 11
.equ	ICR3H4	= 4 ; Timer/Counter3 Input Capture Register  Bytes High Bit 12
.equ	ICR3H5	= 5 ; Timer/Counter3 Input Capture Register  Bytes High Bit 13
.equ	ICR3H6	= 6 ; Timer/Counter3 Input Capture Register  Bytes High Bit 14
.equ	ICR3H7	= 7 ; Timer/Counter3 Input Capture Register  Bytes High Bit 15

.equ	ICR3L0	= 0 ; Timer/Counter3 Input Capture Register  Bytes Low Bit 0
.equ	ICR3L1	= 1 ; Timer/Counter3 Input Capture Register  Bytes Low Bit 1
.equ	ICR3L2	= 2 ; Timer/Counter3 Input Capture Register  Bytes Low Bit 2
.equ	ICR3L3	= 3 ; Timer/Counter3 Input Capture Register  Bytes Low Bit 3
.equ	ICR3L4	= 4 ; Timer/Counter3 Input Capture Register  Bytes Low Bit 4
.equ	ICR3L5	= 5 ; Timer/Counter3 Input Capture Register  Bytes Low Bit 5
.equ	ICR3L6	= 6 ; Timer/Counter3 Input Capture Register  Bytes Low Bit 6
.equ	ICR3L7	= 7 ; Timer/Counter3 Input Capture Register  Bytes Low Bit 7

; TIMSK3 - Timer/Counter3 Interrupt Mask Register
.equ	TOIE3	= 0 ; Timer/Counter3 Overflow Interrupt Enable
.equ	OCIE3A	= 1 ; Timer/Counter3 Output Compare A Match Interrupt Enable
.equ	OCIE3B	= 2 ; Timer/Counter3 Output Compare B Match Interrupt Enable
.equ	OCIE3C	= 3 ; Timer/Counter3 Output Compare C Match Interrupt Enable
.equ	ICIE3	= 5 ; Timer/Counter3 Input Capture Interrupt Enable

; TIFR3 - Timer/Counter3 Interrupt Flag Register
.equ	TOV3	= 0 ; Timer/Counter3 Overflow Flag
.equ	OCF3A	= 1 ; Timer/Counter3 Output Compare A Match Flag
.equ	OCF3B	= 2 ; Timer/Counter3 Output Compare B Match Flag
.equ	OCF3C	= 3 ; Timer/Counter3 Output Compare C Match Flag
.equ	ICF3	= 5 ; Timer/Counter3 Input Capture Flag


; ***** TIMER_COUNTER_1 *****************
; TCCR1A - Timer/Counter1 Control Register A
.equ	WGM10	= 0 ; Waveform Generation Mode
.equ	WGM11	= 1 ; Waveform Generation Mode
.equ	COM1C0	= 2 ; Compare Output Mode for Channel C
.equ	COM1C1	= 3 ; Compare Output Mode for Channel C
.equ	COM1B0	= 4 ; Compare Output Mode for Channel B
.equ	COM1B1	= 5 ; Compare Output Mode for Channel B
.equ	COM1A0	= 6 ; Compare Output Mode for Channel A
.equ	COM1A1	= 7 ; Compare Output Mode for Channel A

; TCCR1B - Timer/Counter1 Control Register B
.equ	CS10	= 0 ; Clock Select
.equ	CS11	= 1 ; Clock Select
.equ	CS12	= 2 ; Clock Select
.equ	WGM12	= 3 ; Waveform Generation Mode
.equ	WGM13	= 4 ; Waveform Generation Mode
.equ	ICES1	= 6 ; Input Capture 1 Edge Select
.equ	ICNC1	= 7 ; Input Capture 1 Noise Canceller

; TCCR1C - Timer/Counter1 Control Register C
.equ	FOC1C	= 5 ; Force Output Compare for Channel C
.equ	FOC1B	= 6 ; Force Output Compare for Channel B
.equ	FOC1A	= 7 ; Force Output Compare for Channel A

; TCNT1 - Timer/Counter1  Bytes
.equ	TCNT1H0	= 0 ; Timer/Counter1  Bytes High Bit 8
.equ	TCNT1H1	= 1 ; Timer/Counter1  Bytes High Bit 9
.equ	TCNT1H2	= 2 ; Timer/Counter1  Bytes High Bit 10
.equ	TCNT1H3	= 3 ; Timer/Counter1  Bytes High Bit 11
.equ	TCNT1H4	= 4 ; Timer/Counter1  Bytes High Bit 12
.equ	TCNT1H5	= 5 ; Timer/Counter1  Bytes High Bit 13
.equ	TCNT1H6	= 6 ; Timer/Counter1  Bytes High Bit 14
.equ	TCNT1H7	= 7 ; Timer/Counter1  Bytes High Bit 15

.equ	TCNT1L0	= 0 ; Timer/Counter1  Bytes Low Bit 0
.equ	TCNT1L1	= 1 ; Timer/Counter1  Bytes Low Bit 1
.equ	TCNT1L2	= 2 ; Timer/Counter1  Bytes Low Bit 2
.equ	TCNT1L3	= 3 ; Timer/Counter1  Bytes Low Bit 3
.equ	TCNT1L4	= 4 ; Timer/Counter1  Bytes Low Bit 4
.equ	TCNT1L5	= 5 ; Timer/Counter1  Bytes Low Bit 5
.equ	TCNT1L6	= 6 ; Timer/Counter1  Bytes Low Bit 6
.equ	TCNT1L7	= 7 ; Timer/Counter1  Bytes Low Bit 7

; OCR1A - Timer/Counter1 Output Compare Register A  Bytes
.equ	OCR1AH0	= 0 ; Timer/Counter1 Output Compare Register A  Bytes High Bit 8
.equ	OCR1AH1	= 1 ; Timer/Counter1 Output Compare Register A  Bytes High Bit 9
.equ	OCR1AH2	= 2 ; Timer/Counter1 Output Compare Register A  Bytes High Bit 10
.equ	OCR1AH3	= 3 ; Timer/Counter1 Output Compare Register A  Bytes High Bit 11
.equ	OCR1AH4	= 4 ; Timer/Counter1 Output Compare Register A  Bytes High Bit 12
.equ	OCR1AH5	= 5 ; Timer/Counter1 Output Compare Register A  Bytes High Bit 13
.equ	OCR1AH6	= 6 ; Timer/Counter1 Output Compare Register A  Bytes High Bit 14
.equ	OCR1AH7	= 7 ; Timer/Counter1 Output Compare Register A  Bytes High Bit 15

.equ	OCR1AL0	= 0 ; Timer/Counter1 Output Compare Register A  Bytes Low Bit 0
.equ	OCR1AL1	= 1 ; Timer/Counter1 Output Compare Register A  Bytes Low Bit 1
.equ	OCR1AL2	= 2 ; Timer/Counter1 Output Compare Register A  Bytes Low Bit 2
.equ	OCR1AL3	= 3 ; Timer/Counter1 Output Compare Register A  Bytes Low Bit 3
.equ	OCR1AL4	= 4 ; Timer/Counter1 Output Compare Register A  Bytes Low Bit 4
.equ	OCR1AL5	= 5 ; Timer/Counter1 Output Compare Register A  Bytes Low Bit 5
.equ	OCR1AL6	= 6 ; Timer/Counter1 Output Compare Register A  Bytes Low Bit 6
.equ	OCR1AL7	= 7 ; Timer/Counter1 Output Compare Register A  Bytes Low Bit 7

