trol73/avr-make/asm/include/m2564RFR2def.inc
; OCR1B - Timer/Counter1 Output Compare Register B  Bytes
.equ	OCR1BH0	= 0 ; Timer/Counter1 Output Compare Register B  Bytes High Bit 8
.equ	OCR1BH1	= 1 ; Timer/Counter1 Output Compare Register B  Bytes High Bit 9
.equ	OCR1BH2	= 2 ; Timer/Counter1 Output Compare Register B  Bytes High Bit 10
.equ	OCR1BH3	= 3 ; Timer/Counter1 Output Compare Register B  Bytes High Bit 11
.equ	OCR1BH4	= 4 ; Timer/Counter1 Output Compare Register B  Bytes High Bit 12
.equ	OCR1BH5	= 5 ; Timer/Counter1 Output Compare Register B  Bytes High Bit 13
.equ	OCR1BH6	= 6 ; Timer/Counter1 Output Compare Register B  Bytes High Bit 14
.equ	OCR1BH7	= 7 ; Timer/Counter1 Output Compare Register B  Bytes High Bit 15

.equ	OCR1BL0	= 0 ; Timer/Counter1 Output Compare Register B  Bytes Low Bit 0
.equ	OCR1BL1	= 1 ; Timer/Counter1 Output Compare Register B  Bytes Low Bit 1
.equ	OCR1BL2	= 2 ; Timer/Counter1 Output Compare Register B  Bytes Low Bit 2
.equ	OCR1BL3	= 3 ; Timer/Counter1 Output Compare Register B  Bytes Low Bit 3
.equ	OCR1BL4	= 4 ; Timer/Counter1 Output Compare Register B  Bytes Low Bit 4
.equ	OCR1BL5	= 5 ; Timer/Counter1 Output Compare Register B  Bytes Low Bit 5
.equ	OCR1BL6	= 6 ; Timer/Counter1 Output Compare Register B  Bytes Low Bit 6
.equ	OCR1BL7	= 7 ; Timer/Counter1 Output Compare Register B  Bytes Low Bit 7

; OCR1C - Timer/Counter1 Output Compare Register C  Bytes
.equ	OCR1CH0	= 0 ; Timer/Counter1 Output Compare Register C  Bytes High Bit 8
.equ	OCR1CH1	= 1 ; Timer/Counter1 Output Compare Register C  Bytes High Bit 9
.equ	OCR1CH2	= 2 ; Timer/Counter1 Output Compare Register C  Bytes High Bit 10
.equ	OCR1CH3	= 3 ; Timer/Counter1 Output Compare Register C  Bytes High Bit 11
.equ	OCR1CH4	= 4 ; Timer/Counter1 Output Compare Register C  Bytes High Bit 12
.equ	OCR1CH5	= 5 ; Timer/Counter1 Output Compare Register C  Bytes High Bit 13
.equ	OCR1CH6	= 6 ; Timer/Counter1 Output Compare Register C  Bytes High Bit 14
.equ	OCR1CH7	= 7 ; Timer/Counter1 Output Compare Register C  Bytes High Bit 15

.equ	OCR1CL0	= 0 ; Timer/Counter1 Output Compare Register C  Bytes Low Bit 0
.equ	OCR1CL1	= 1 ; Timer/Counter1 Output Compare Register C  Bytes Low Bit 1
.equ	OCR1CL2	= 2 ; Timer/Counter1 Output Compare Register C  Bytes Low Bit 2
.equ	OCR1CL3	= 3 ; Timer/Counter1 Output Compare Register C  Bytes Low Bit 3
.equ	OCR1CL4	= 4 ; Timer/Counter1 Output Compare Register C  Bytes Low Bit 4
.equ	OCR1CL5	= 5 ; Timer/Counter1 Output Compare Register C  Bytes Low Bit 5
.equ	OCR1CL6	= 6 ; Timer/Counter1 Output Compare Register C  Bytes Low Bit 6
.equ	OCR1CL7	= 7 ; Timer/Counter1 Output Compare Register C  Bytes Low Bit 7

; ICR1 - Timer/Counter1 Input Capture Register  Bytes
.equ	ICR1H0	= 0 ; Timer/Counter1 Input Capture Register  Bytes High Bit 8
.equ	ICR1H1	= 1 ; Timer/Counter1 Input Capture Register  Bytes High Bit 9
.equ	ICR1H2	= 2 ; Timer/Counter1 Input Capture Register  Bytes High Bit 10
.equ	ICR1H3	= 3 ; Timer/Counter1 Input Capture Register  Bytes High Bit 11
.equ	ICR1H4	= 4 ; Timer/Counter1 Input Capture Register  Bytes High Bit 12
.equ	ICR1H5	= 5 ; Timer/Counter1 Input Capture Register  Bytes High Bit 13
.equ	ICR1H6	= 6 ; Timer/Counter1 Input Capture Register  Bytes High Bit 14
.equ	ICR1H7	= 7 ; Timer/Counter1 Input Capture Register  Bytes High Bit 15

.equ	ICR1L0	= 0 ; Timer/Counter1 Input Capture Register  Bytes Low Bit 0
.equ	ICR1L1	= 1 ; Timer/Counter1 Input Capture Register  Bytes Low Bit 1
.equ	ICR1L2	= 2 ; Timer/Counter1 Input Capture Register  Bytes Low Bit 2
.equ	ICR1L3	= 3 ; Timer/Counter1 Input Capture Register  Bytes Low Bit 3
.equ	ICR1L4	= 4 ; Timer/Counter1 Input Capture Register  Bytes Low Bit 4
.equ	ICR1L5	= 5 ; Timer/Counter1 Input Capture Register  Bytes Low Bit 5
.equ	ICR1L6	= 6 ; Timer/Counter1 Input Capture Register  Bytes Low Bit 6
.equ	ICR1L7	= 7 ; Timer/Counter1 Input Capture Register  Bytes Low Bit 7

; TIMSK1 - Timer/Counter1 Interrupt Mask Register
.equ	TOIE1	= 0 ; Timer/Counter1 Overflow Interrupt Enable
.equ	OCIE1A	= 1 ; Timer/Counter1 Output Compare A Match Interrupt Enable
.equ	OCIE1B	= 2 ; Timer/Counter1 Output Compare B Match Interrupt Enable
.equ	OCIE1C	= 3 ; Timer/Counter1 Output Compare C Match Interrupt Enable
.equ	ICIE1	= 5 ; Timer/Counter1 Input Capture Interrupt Enable

; TIFR1 - Timer/Counter1 Interrupt Flag Register
.equ	TOV1	= 0 ; Timer/Counter1 Overflow Flag
.equ	OCF1A	= 1 ; Timer/Counter1 Output Compare A Match Flag
.equ	OCF1B	= 2 ; Timer/Counter1 Output Compare B Match Flag
.equ	OCF1C	= 3 ; Timer/Counter1 Output Compare C Match Flag
.equ	ICF1	= 5 ; Timer/Counter1 Input Capture Flag


; ***** TRX24 *****************
; PARCR - Power Amplifier Ramp up/down Control Register
.equ	PARUFI	= 0 ; Power Amplifier Ramp Up Frequency Inversion
.equ	PARDFI	= 1 ; Power Amplifier Ramp Down Frequency Inversion
.equ	PALTU0	= 2 ; ext. PA Ramp Up Lead Time
.equ	PALTU1	= 3 ; ext. PA Ramp Up Lead Time
.equ	PALTU2	= 4 ; ext. PA Ramp Up Lead Time
.equ	PALTD0	= 5 ; ext. PA Ramp Down Lead Time
.equ	PALTD1	= 6 ; ext. PA Ramp Down Lead Time
.equ	PALTD2	= 7 ; ext. PA Ramp Down Lead Time

; MAFSA0L - Transceiver MAC Short Address Register for Frame Filter 0 (Low Byte)
.equ	MAFSA0L0	= 0 ; MAC Short Address low Byte for Frame Filter 0
.equ	MAFSA0L1	= 1 ; MAC Short Address low Byte for Frame Filter 0
.equ	MAFSA0L2	= 2 ; MAC Short Address low Byte for Frame Filter 0
.equ	MAFSA0L3	= 3 ; MAC Short Address low Byte for Frame Filter 0
.equ	MAFSA0L4	= 4 ; MAC Short Address low Byte for Frame Filter 0
.equ	MAFSA0L5	= 5 ; MAC Short Address low Byte for Frame Filter 0
.equ	MAFSA0L6	= 6 ; MAC Short Address low Byte for Frame Filter 0
.equ	MAFSA0L7	= 7 ; MAC Short Address low Byte for Frame Filter 0

; MAFSA0H - Transceiver MAC Short Address Register for Frame Filter 0 (High Byte)
.equ	MAFSA0H0	= 0 ; MAC Short Address high Byte for Frame Filter 0
.equ	MAFSA0H1	= 1 ; MAC Short Address high Byte for Frame Filter 0
.equ	MAFSA0H2	= 2 ; MAC Short Address high Byte for Frame Filter 0
.equ	MAFSA0H3	= 3 ; MAC Short Address high Byte for Frame Filter 0
.equ	MAFSA0H4	= 4 ; MAC Short Address high Byte for Frame Filter 0
.equ	MAFSA0H5	= 5 ; MAC Short Address high Byte for Frame Filter 0
.equ	MAFSA0H6	= 6 ; MAC Short Address high Byte for Frame Filter 0
.equ	MAFSA0H7	= 7 ; MAC Short Address high Byte for Frame Filter 0

; MAFPA0L - Transceiver Personal Area Network ID Register for Frame Filter 0 (Low Byte)
.equ	MAFPA0L0	= 0 ; MAC Personal Area Network ID low Byte for Frame Filter 0
.equ	MAFPA0L1	= 1 ; MAC Personal Area Network ID low Byte for Frame Filter 0
.equ	MAFPA0L2	= 2 ; MAC Personal Area Network ID low Byte for Frame Filter 0
.equ	MAFPA0L3	= 3 ; MAC Personal Area Network ID low Byte for Frame Filter 0
.equ	MAFPA0L4	= 4 ; MAC Personal Area Network ID low Byte for Frame Filter 0
.equ	MAFPA0L5	= 5 ; MAC Personal Area Network ID low Byte for Frame Filter 0
.equ	MAFPA0L6	= 6 ; MAC Personal Area Network ID low Byte for Frame Filter 0
.equ	MAFPA0L7	= 7 ; MAC Personal Area Network ID low Byte for Frame Filter 0

; MAFPA0H - Transceiver Personal Area Network ID Register for Frame Filter 0 (High Byte)
.equ	MAFPA0H0	= 0 ; MAC Personal Area Network ID high Byte for Frame Filter 0
.equ	MAFPA0H1	= 1 ; MAC Personal Area Network ID high Byte for Frame Filter 0
.equ	MAFPA0H2	= 2 ; MAC Personal Area Network ID high Byte for Frame Filter 0
.equ	MAFPA0H3	= 3 ; MAC Personal Area Network ID high Byte for Frame Filter 0
.equ	MAFPA0H4	= 4 ; MAC Personal Area Network ID high Byte for Frame Filter 0
.equ	MAFPA0H5	= 5 ; MAC Personal Area Network ID high Byte for Frame Filter 0
.equ	MAFPA0H6	= 6 ; MAC Personal Area Network ID high Byte for Frame Filter 0
.equ	MAFPA0H7	= 7 ; MAC Personal Area Network ID high Byte for Frame Filter 0

; MAFSA1L - Transceiver MAC Short Address Register for Frame Filter 1 (Low Byte)
.equ	MAFSA1L0	= 0 ; MAC Short Address low Byte for Frame Filter 1
.equ	MAFSA1L1	= 1 ; MAC Short Address low Byte for Frame Filter 1
.equ	MAFSA1L2	= 2 ; MAC Short Address low Byte for Frame Filter 1
.equ	MAFSA1L3	= 3 ; MAC Short Address low Byte for Frame Filter 1
.equ	MAFSA1L4	= 4 ; MAC Short Address low Byte for Frame Filter 1
.equ	MAFSA1L5	= 5 ; MAC Short Address low Byte for Frame Filter 1
.equ	MAFSA1L6	= 6 ; MAC Short Address low Byte for Frame Filter 1
.equ	MAFSA1L7	= 7 ; MAC Short Address low Byte for Frame Filter 1

; MAFSA1H - Transceiver MAC Short Address Register for Frame Filter 1 (High Byte)
.equ	MAFSA1H0	= 0 ; MAC Short Address high Byte for Frame Filter 1
.equ	MAFSA1H1	= 1 ; MAC Short Address high Byte for Frame Filter 1
.equ	MAFSA1H2	= 2 ; MAC Short Address high Byte for Frame Filter 1
.equ	MAFSA1H3	= 3 ; MAC Short Address high Byte for Frame Filter 1
.equ	MAFSA1H4	= 4 ; MAC Short Address high Byte for Frame Filter 1
.equ	MAFSA1H5	= 5 ; MAC Short Address high Byte for Frame Filter 1
.equ	MAFSA1H6	= 6 ; MAC Short Address high Byte for Frame Filter 1
.equ	MAFSA1H7	= 7 ; MAC Short Address high Byte for Frame Filter 1

; MAFPA1L - Transceiver Personal Area Network ID Register for Frame Filter 1 (Low Byte)
.equ	MAFPA1L0	= 0 ; MAC Personal Area Network ID low Byte for Frame Filter 1
.equ	MAFPA1L1	= 1 ; MAC Personal Area Network ID low Byte for Frame Filter 1
.equ	MAFPA1L2	= 2 ; MAC Personal Area Network ID low Byte for Frame Filter 1
.equ	MAFPA1L3	= 3 ; MAC Personal Area Network ID low Byte for Frame Filter 1
.equ	MAFPA1L4	= 4 ; MAC Personal Area Network ID low Byte for Frame Filter 1
.equ	MAFPA1L5	= 5 ; MAC Personal Area Network ID low Byte for Frame Filter 1
.equ	MAFPA1L6	= 6 ; MAC Personal Area Network ID low Byte for Frame Filter 1
.equ	MAFPA1L7	= 7 ; MAC Personal Area Network ID low Byte for Frame Filter 1

; MAFPA1H - Transceiver Personal Area Network ID Register for Frame Filter 1 (High Byte)
.equ	MAFPA1H0	= 0 ; MAC Personal Area Network ID high Byte for Frame Filter 1
.equ	MAFPA1H1	= 1 ; MAC Personal Area Network ID high Byte for Frame Filter 1
.equ	MAFPA1H2	= 2 ; MAC Personal Area Network ID high Byte for Frame Filter 1
.equ	MAFPA1H3	= 3 ; MAC Personal Area Network ID high Byte for Frame Filter 1
.equ	MAFPA1H4	= 4 ; MAC Personal Area Network ID high Byte for Frame Filter 1
.equ	MAFPA1H5	= 5 ; MAC Personal Area Network ID high Byte for Frame Filter 1
.equ	MAFPA1H6	= 6 ; MAC Personal Area Network ID high Byte for Frame Filter 1
.equ	MAFPA1H7	= 7 ; MAC Personal Area Network ID high Byte for Frame Filter 1

