trol73/avr-make/asm/include/m2564RFR2def.inc
; SCOCR2LL - Symbol Counter Output Compare Register 2 LL-Byte
.equ	SCOCR2LL0	= 0 ; Symbol Counter Output Compare Register 2 LL-Byte
.equ	SCOCR2LL1	= 1 ; Symbol Counter Output Compare Register 2 LL-Byte
.equ	SCOCR2LL2	= 2 ; Symbol Counter Output Compare Register 2 LL-Byte
.equ	SCOCR2LL3	= 3 ; Symbol Counter Output Compare Register 2 LL-Byte
.equ	SCOCR2LL4	= 4 ; Symbol Counter Output Compare Register 2 LL-Byte
.equ	SCOCR2LL5	= 5 ; Symbol Counter Output Compare Register 2 LL-Byte
.equ	SCOCR2LL6	= 6 ; Symbol Counter Output Compare Register 2 LL-Byte
.equ	SCOCR2LL7	= 7 ; Symbol Counter Output Compare Register 2 LL-Byte

; SCOCR3HH - Symbol Counter Output Compare Register 3 HH-Byte
.equ	SCOCR3HH0	= 0 ; Symbol Counter Output Compare Register 3 HH-Byte
.equ	SCOCR3HH1	= 1 ; Symbol Counter Output Compare Register 3 HH-Byte
.equ	SCOCR3HH2	= 2 ; Symbol Counter Output Compare Register 3 HH-Byte
.equ	SCOCR3HH3	= 3 ; Symbol Counter Output Compare Register 3 HH-Byte
.equ	SCOCR3HH4	= 4 ; Symbol Counter Output Compare Register 3 HH-Byte
.equ	SCOCR3HH5	= 5 ; Symbol Counter Output Compare Register 3 HH-Byte
.equ	SCOCR3HH6	= 6 ; Symbol Counter Output Compare Register 3 HH-Byte
.equ	SCOCR3HH7	= 7 ; Symbol Counter Output Compare Register 3 HH-Byte

; SCOCR3HL - Symbol Counter Output Compare Register 3 HL-Byte
.equ	SCOCR3HL0	= 0 ; Symbol Counter Output Compare Register 3 HL-Byte
.equ	SCOCR3HL1	= 1 ; Symbol Counter Output Compare Register 3 HL-Byte
.equ	SCOCR3HL2	= 2 ; Symbol Counter Output Compare Register 3 HL-Byte
.equ	SCOCR3HL3	= 3 ; Symbol Counter Output Compare Register 3 HL-Byte
.equ	SCOCR3HL4	= 4 ; Symbol Counter Output Compare Register 3 HL-Byte
.equ	SCOCR3HL5	= 5 ; Symbol Counter Output Compare Register 3 HL-Byte
.equ	SCOCR3HL6	= 6 ; Symbol Counter Output Compare Register 3 HL-Byte
.equ	SCOCR3HL7	= 7 ; Symbol Counter Output Compare Register 3 HL-Byte

; SCOCR3LH - Symbol Counter Output Compare Register 3 LH-Byte
.equ	SCOCR3LH0	= 0 ; Symbol Counter Output Compare Register 3 LH-Byte
.equ	SCOCR3LH1	= 1 ; Symbol Counter Output Compare Register 3 LH-Byte
.equ	SCOCR3LH2	= 2 ; Symbol Counter Output Compare Register 3 LH-Byte
.equ	SCOCR3LH3	= 3 ; Symbol Counter Output Compare Register 3 LH-Byte
.equ	SCOCR3LH4	= 4 ; Symbol Counter Output Compare Register 3 LH-Byte
.equ	SCOCR3LH5	= 5 ; Symbol Counter Output Compare Register 3 LH-Byte
.equ	SCOCR3LH6	= 6 ; Symbol Counter Output Compare Register 3 LH-Byte
.equ	SCOCR3LH7	= 7 ; Symbol Counter Output Compare Register 3 LH-Byte

; SCOCR3LL - Symbol Counter Output Compare Register 3 LL-Byte
.equ	SCOCR3LL0	= 0 ; Symbol Counter Output Compare Register 3 LL-Byte
.equ	SCOCR3LL1	= 1 ; Symbol Counter Output Compare Register 3 LL-Byte
.equ	SCOCR3LL2	= 2 ; Symbol Counter Output Compare Register 3 LL-Byte
.equ	SCOCR3LL3	= 3 ; Symbol Counter Output Compare Register 3 LL-Byte
.equ	SCOCR3LL4	= 4 ; Symbol Counter Output Compare Register 3 LL-Byte
.equ	SCOCR3LL5	= 5 ; Symbol Counter Output Compare Register 3 LL-Byte
.equ	SCOCR3LL6	= 6 ; Symbol Counter Output Compare Register 3 LL-Byte
.equ	SCOCR3LL7	= 7 ; Symbol Counter Output Compare Register 3 LL-Byte

; SCTSRHH - Symbol Counter Frame Timestamp Register HH-Byte
.equ	SCTSRHH0	= 0 ; Symbol Counter Frame Timestamp Register HH-Byte
.equ	SCTSRHH1	= 1 ; Symbol Counter Frame Timestamp Register HH-Byte
.equ	SCTSRHH2	= 2 ; Symbol Counter Frame Timestamp Register HH-Byte
.equ	SCTSRHH3	= 3 ; Symbol Counter Frame Timestamp Register HH-Byte
.equ	SCTSRHH4	= 4 ; Symbol Counter Frame Timestamp Register HH-Byte
.equ	SCTSRHH5	= 5 ; Symbol Counter Frame Timestamp Register HH-Byte
.equ	SCTSRHH6	= 6 ; Symbol Counter Frame Timestamp Register HH-Byte
.equ	SCTSRHH7	= 7 ; Symbol Counter Frame Timestamp Register HH-Byte

; SCTSRHL - Symbol Counter Frame Timestamp Register HL-Byte
.equ	SCTSRHL0	= 0 ; Symbol Counter Frame Timestamp Register HL-Byte
.equ	SCTSRHL1	= 1 ; Symbol Counter Frame Timestamp Register HL-Byte
.equ	SCTSRHL2	= 2 ; Symbol Counter Frame Timestamp Register HL-Byte
.equ	SCTSRHL3	= 3 ; Symbol Counter Frame Timestamp Register HL-Byte
.equ	SCTSRHL4	= 4 ; Symbol Counter Frame Timestamp Register HL-Byte
.equ	SCTSRHL5	= 5 ; Symbol Counter Frame Timestamp Register HL-Byte
.equ	SCTSRHL6	= 6 ; Symbol Counter Frame Timestamp Register HL-Byte
.equ	SCTSRHL7	= 7 ; Symbol Counter Frame Timestamp Register HL-Byte

; SCTSRLH - Symbol Counter Frame Timestamp Register LH-Byte
.equ	SCTSRLH0	= 0 ; Symbol Counter Frame Timestamp Register LH-Byte
.equ	SCTSRLH1	= 1 ; Symbol Counter Frame Timestamp Register LH-Byte
.equ	SCTSRLH2	= 2 ; Symbol Counter Frame Timestamp Register LH-Byte
.equ	SCTSRLH3	= 3 ; Symbol Counter Frame Timestamp Register LH-Byte
.equ	SCTSRLH4	= 4 ; Symbol Counter Frame Timestamp Register LH-Byte
.equ	SCTSRLH5	= 5 ; Symbol Counter Frame Timestamp Register LH-Byte
.equ	SCTSRLH6	= 6 ; Symbol Counter Frame Timestamp Register LH-Byte
.equ	SCTSRLH7	= 7 ; Symbol Counter Frame Timestamp Register LH-Byte

; SCTSRLL - Symbol Counter Frame Timestamp Register LL-Byte
.equ	SCTSRLL0	= 0 ; Symbol Counter Frame Timestamp Register LL-Byte
.equ	SCTSRLL1	= 1 ; Symbol Counter Frame Timestamp Register LL-Byte
.equ	SCTSRLL2	= 2 ; Symbol Counter Frame Timestamp Register LL-Byte
.equ	SCTSRLL3	= 3 ; Symbol Counter Frame Timestamp Register LL-Byte
.equ	SCTSRLL4	= 4 ; Symbol Counter Frame Timestamp Register LL-Byte
.equ	SCTSRLL5	= 5 ; Symbol Counter Frame Timestamp Register LL-Byte
.equ	SCTSRLL6	= 6 ; Symbol Counter Frame Timestamp Register LL-Byte
.equ	SCTSRLL7	= 7 ; Symbol Counter Frame Timestamp Register LL-Byte

; SCBTSRHH - Symbol Counter Beacon Timestamp Register HH-Byte
.equ	SCBTSRHH0	= 0 ; Symbol Counter Beacon Timestamp Register HH-Byte
.equ	SCBTSRHH1	= 1 ; Symbol Counter Beacon Timestamp Register HH-Byte
.equ	SCBTSRHH2	= 2 ; Symbol Counter Beacon Timestamp Register HH-Byte
.equ	SCBTSRHH3	= 3 ; Symbol Counter Beacon Timestamp Register HH-Byte
.equ	SCBTSRHH4	= 4 ; Symbol Counter Beacon Timestamp Register HH-Byte
.equ	SCBTSRHH5	= 5 ; Symbol Counter Beacon Timestamp Register HH-Byte
.equ	SCBTSRHH6	= 6 ; Symbol Counter Beacon Timestamp Register HH-Byte
.equ	SCBTSRHH7	= 7 ; Symbol Counter Beacon Timestamp Register HH-Byte

