trol73/avr-make/asm/include/m2564RFR2def.inc
; SCBTSRHL - Symbol Counter Beacon Timestamp Register HL-Byte
.equ	SCBTSRHL0	= 0 ; Symbol Counter Beacon Timestamp Register HL-Byte
.equ	SCBTSRHL1	= 1 ; Symbol Counter Beacon Timestamp Register HL-Byte
.equ	SCBTSRHL2	= 2 ; Symbol Counter Beacon Timestamp Register HL-Byte
.equ	SCBTSRHL3	= 3 ; Symbol Counter Beacon Timestamp Register HL-Byte
.equ	SCBTSRHL4	= 4 ; Symbol Counter Beacon Timestamp Register HL-Byte
.equ	SCBTSRHL5	= 5 ; Symbol Counter Beacon Timestamp Register HL-Byte
.equ	SCBTSRHL6	= 6 ; Symbol Counter Beacon Timestamp Register HL-Byte
.equ	SCBTSRHL7	= 7 ; Symbol Counter Beacon Timestamp Register HL-Byte

; SCBTSRLH - Symbol Counter Beacon Timestamp Register LH-Byte
.equ	SCBTSRLH0	= 0 ; Symbol Counter Beacon Timestamp Register LH-Byte
.equ	SCBTSRLH1	= 1 ; Symbol Counter Beacon Timestamp Register LH-Byte
.equ	SCBTSRLH2	= 2 ; Symbol Counter Beacon Timestamp Register LH-Byte
.equ	SCBTSRLH3	= 3 ; Symbol Counter Beacon Timestamp Register LH-Byte
.equ	SCBTSRLH4	= 4 ; Symbol Counter Beacon Timestamp Register LH-Byte
.equ	SCBTSRLH5	= 5 ; Symbol Counter Beacon Timestamp Register LH-Byte
.equ	SCBTSRLH6	= 6 ; Symbol Counter Beacon Timestamp Register LH-Byte
.equ	SCBTSRLH7	= 7 ; Symbol Counter Beacon Timestamp Register LH-Byte

; SCBTSRLL - Symbol Counter Beacon Timestamp Register LL-Byte
.equ	SCBTSRLL0	= 0 ; Symbol Counter Beacon Timestamp Register LL-Byte
.equ	SCBTSRLL1	= 1 ; Symbol Counter Beacon Timestamp Register LL-Byte
.equ	SCBTSRLL2	= 2 ; Symbol Counter Beacon Timestamp Register LL-Byte
.equ	SCBTSRLL3	= 3 ; Symbol Counter Beacon Timestamp Register LL-Byte
.equ	SCBTSRLL4	= 4 ; Symbol Counter Beacon Timestamp Register LL-Byte
.equ	SCBTSRLL5	= 5 ; Symbol Counter Beacon Timestamp Register LL-Byte
.equ	SCBTSRLL6	= 6 ; Symbol Counter Beacon Timestamp Register LL-Byte
.equ	SCBTSRLL7	= 7 ; Symbol Counter Beacon Timestamp Register LL-Byte

; SCCNTHH - Symbol Counter Register HH-Byte
.equ	SCCNTHH0	= 0 ; Symbol Counter Register HH-Byte
.equ	SCCNTHH1	= 1 ; Symbol Counter Register HH-Byte
.equ	SCCNTHH2	= 2 ; Symbol Counter Register HH-Byte
.equ	SCCNTHH3	= 3 ; Symbol Counter Register HH-Byte
.equ	SCCNTHH4	= 4 ; Symbol Counter Register HH-Byte
.equ	SCCNTHH5	= 5 ; Symbol Counter Register HH-Byte
.equ	SCCNTHH6	= 6 ; Symbol Counter Register HH-Byte
.equ	SCCNTHH7	= 7 ; Symbol Counter Register HH-Byte

; SCCNTHL - Symbol Counter Register HL-Byte
.equ	SCCNTHL0	= 0 ; Symbol Counter Register HL-Byte
.equ	SCCNTHL1	= 1 ; Symbol Counter Register HL-Byte
.equ	SCCNTHL2	= 2 ; Symbol Counter Register HL-Byte
.equ	SCCNTHL3	= 3 ; Symbol Counter Register HL-Byte
.equ	SCCNTHL4	= 4 ; Symbol Counter Register HL-Byte
.equ	SCCNTHL5	= 5 ; Symbol Counter Register HL-Byte
.equ	SCCNTHL6	= 6 ; Symbol Counter Register HL-Byte
.equ	SCCNTHL7	= 7 ; Symbol Counter Register HL-Byte

; SCCNTLH - Symbol Counter Register LH-Byte
.equ	SCCNTLH0	= 0 ; Symbol Counter Register LH-Byte
.equ	SCCNTLH1	= 1 ; Symbol Counter Register LH-Byte
.equ	SCCNTLH2	= 2 ; Symbol Counter Register LH-Byte
.equ	SCCNTLH3	= 3 ; Symbol Counter Register LH-Byte
.equ	SCCNTLH4	= 4 ; Symbol Counter Register LH-Byte
.equ	SCCNTLH5	= 5 ; Symbol Counter Register LH-Byte
.equ	SCCNTLH6	= 6 ; Symbol Counter Register LH-Byte
.equ	SCCNTLH7	= 7 ; Symbol Counter Register LH-Byte

; SCCNTLL - Symbol Counter Register LL-Byte
.equ	SCCNTLL0	= 0 ; Symbol Counter Register LL-Byte
.equ	SCCNTLL1	= 1 ; Symbol Counter Register LL-Byte
.equ	SCCNTLL2	= 2 ; Symbol Counter Register LL-Byte
.equ	SCCNTLL3	= 3 ; Symbol Counter Register LL-Byte
.equ	SCCNTLL4	= 4 ; Symbol Counter Register LL-Byte
.equ	SCCNTLL5	= 5 ; Symbol Counter Register LL-Byte
.equ	SCCNTLL6	= 6 ; Symbol Counter Register LL-Byte
.equ	SCCNTLL7	= 7 ; Symbol Counter Register LL-Byte

; SCIRQS - Symbol Counter Interrupt Status Register
.equ	IRQSCP1	= 0 ; Compare Unit 3 Compare Match IRQ
.equ	IRQSCP2	= 1 ; Compare Unit 3 Compare Match IRQ
.equ	IRQSCP3	= 2 ; Compare Unit 3 Compare Match IRQ
.equ	IRQSOF	= 3 ; Symbol Counter Overflow IRQ
.equ	IRQSBO	= 4 ; Backoff Slot Counter IRQ

; SCIRQM - Symbol Counter Interrupt Mask Register
.equ	IRQMCP1	= 0 ; Symbol Counter Compare Match 3 IRQ enable
.equ	IRQMCP2	= 1 ; Symbol Counter Compare Match 3 IRQ enable
.equ	IRQMCP3	= 2 ; Symbol Counter Compare Match 3 IRQ enable
.equ	IRQMOF	= 3 ; Symbol Counter Overflow IRQ enable
.equ	IRQMBO	= 4 ; Backoff Slot Counter IRQ enable

; SCSR - Symbol Counter Status Register
.equ	SCBSY	= 0 ; Symbol Counter busy
.equ	Res6	= 7 ; Reserved Bit

; SCCR1 - Symbol Counter Control Register 1
.equ	SCENBO	= 0 ; Backoff Slot Counter enable
.equ	SCEECLK	= 1 ; Enable External Clock Source on PG2
.equ	SCCKDIV0	= 2 ; Clock divider for synchronous clock source (16MHz Transceiver Clock)
.equ	SCCKDIV1	= 3 ; Clock divider for synchronous clock source (16MHz Transceiver Clock)
.equ	SCCKDIV2	= 4 ; Clock divider for synchronous clock source (16MHz Transceiver Clock)
.equ	SCBTSM	= 5 ; Symbol Counter Beacon Timestamp Mask Register

; SCCR0 - Symbol Counter Control Register 0
.equ	SCCMP1	= 0 ; Symbol Counter Compare Unit 3 Mode select
.equ	SCCMP2	= 1 ; Symbol Counter Compare Unit 3 Mode select
.equ	SCCMP3	= 2 ; Symbol Counter Compare Unit 3 Mode select
.equ	SCTSE	= 3 ; Symbol Counter Automatic Timestamping enable
.equ	SCCKSEL	= 4 ; Symbol Counter Clock Source select
.equ	SCEN	= 5 ; Symbol Counter enable
.equ	SCMBTS	= 6 ; Manual Beacon Timestamp
.equ	SCRES	= 7 ; Symbol Counter Synchronization

; SCCSR - Symbol Counter Compare Source Register
.equ	SCCS10	= 0 ; Symbol Counter Compare Source select register for Compare Units
.equ	SCCS11	= 1 ; Symbol Counter Compare Source select register for Compare Units
.equ	SCCS20	= 2 ; Symbol Counter Compare Source select register for Compare Unit 2
.equ	SCCS21	= 3 ; Symbol Counter Compare Source select register for Compare Unit 2
.equ	SCCS30	= 4 ; Symbol Counter Compare Source select register for Compare Unit 3
.equ	SCCS31	= 5 ; Symbol Counter Compare Source select register for Compare Unit 3

; SCRSTRHH - Symbol Counter Received Frame Timestamp Register HH-Byte
.equ	SCRSTRHH0	= 0 ; Symbol Counter Received Frame Timestamp Register HH-Byte
.equ	SCRSTRHH1	= 1 ; Symbol Counter Received Frame Timestamp Register HH-Byte
.equ	SCRSTRHH2	= 2 ; Symbol Counter Received Frame Timestamp Register HH-Byte
.equ	SCRSTRHH3	= 3 ; Symbol Counter Received Frame Timestamp Register HH-Byte
.equ	SCRSTRHH4	= 4 ; Symbol Counter Received Frame Timestamp Register HH-Byte
.equ	SCRSTRHH5	= 5 ; Symbol Counter Received Frame Timestamp Register HH-Byte
.equ	SCRSTRHH6	= 6 ; Symbol Counter Received Frame Timestamp Register HH-Byte
.equ	SCRSTRHH7	= 7 ; Symbol Counter Received Frame Timestamp Register HH-Byte

; SCRSTRHL - Symbol Counter Received Frame Timestamp Register HL-Byte
.equ	SCRSTRHL0	= 0 ; Symbol Counter Received Frame Timestamp Register HL-Byte
.equ	SCRSTRHL1	= 1 ; Symbol Counter Received Frame Timestamp Register HL-Byte
.equ	SCRSTRHL2	= 2 ; Symbol Counter Received Frame Timestamp Register HL-Byte
.equ	SCRSTRHL3	= 3 ; Symbol Counter Received Frame Timestamp Register HL-Byte
.equ	SCRSTRHL4	= 4 ; Symbol Counter Received Frame Timestamp Register HL-Byte
.equ	SCRSTRHL5	= 5 ; Symbol Counter Received Frame Timestamp Register HL-Byte
.equ	SCRSTRHL6	= 6 ; Symbol Counter Received Frame Timestamp Register HL-Byte
.equ	SCRSTRHL7	= 7 ; Symbol Counter Received Frame Timestamp Register HL-Byte

; SCRSTRLH - Symbol Counter Received Frame Timestamp Register LH-Byte
.equ	SCRSTRLH0	= 0 ; Symbol Counter Received Frame Timestamp Register LH-Byte
.equ	SCRSTRLH1	= 1 ; Symbol Counter Received Frame Timestamp Register LH-Byte
.equ	SCRSTRLH2	= 2 ; Symbol Counter Received Frame Timestamp Register LH-Byte
.equ	SCRSTRLH3	= 3 ; Symbol Counter Received Frame Timestamp Register LH-Byte
.equ	SCRSTRLH4	= 4 ; Symbol Counter Received Frame Timestamp Register LH-Byte
.equ	SCRSTRLH5	= 5 ; Symbol Counter Received Frame Timestamp Register LH-Byte
.equ	SCRSTRLH6	= 6 ; Symbol Counter Received Frame Timestamp Register LH-Byte
.equ	SCRSTRLH7	= 7 ; Symbol Counter Received Frame Timestamp Register LH-Byte

; SCRSTRLL - Symbol Counter Received Frame Timestamp Register LL-Byte
.equ	SCRSTRLL0	= 0 ; Symbol Counter Received Frame Timestamp Register LL-Byte
.equ	SCRSTRLL1	= 1 ; Symbol Counter Received Frame Timestamp Register LL-Byte
.equ	SCRSTRLL2	= 2 ; Symbol Counter Received Frame Timestamp Register LL-Byte
.equ	SCRSTRLL3	= 3 ; Symbol Counter Received Frame Timestamp Register LL-Byte
.equ	SCRSTRLL4	= 4 ; Symbol Counter Received Frame Timestamp Register LL-Byte
.equ	SCRSTRLL5	= 5 ; Symbol Counter Received Frame Timestamp Register LL-Byte
.equ	SCRSTRLL6	= 6 ; Symbol Counter Received Frame Timestamp Register LL-Byte
.equ	SCRSTRLL7	= 7 ; Symbol Counter Received Frame Timestamp Register LL-Byte


; ***** EEPROM *****************
; EEAR - EEPROM Address Register  Bytes
.equ	EEARH0	= 0 ; EEPROM Address Register  Bytes High Bit 8
.equ	EEARH1	= 1 ; EEPROM Address Register  Bytes High Bit 9
.equ	EEARH2	= 2 ; EEPROM Address Register  Bytes High Bit 10
.equ	EEARH3	= 3 ; EEPROM Address Register  Bytes High Bit 11
.equ	EEARH4	= 4 ; EEPROM Address Register  Bytes High Bit 12
.equ	EEARH5	= 5 ; EEPROM Address Register  Bytes High Bit 13
.equ	EEARH6	= 6 ; EEPROM Address Register  Bytes High Bit 14
.equ	EEARH7	= 7 ; EEPROM Address Register  Bytes High Bit 15

.equ	EEARL0	= 0 ; EEPROM Address Register  Bytes Low Bit 0
.equ	EEARL1	= 1 ; EEPROM Address Register  Bytes Low Bit 1
.equ	EEARL2	= 2 ; EEPROM Address Register  Bytes Low Bit 2
.equ	EEARL3	= 3 ; EEPROM Address Register  Bytes Low Bit 3
.equ	EEARL4	= 4 ; EEPROM Address Register  Bytes Low Bit 4
.equ	EEARL5	= 5 ; EEPROM Address Register  Bytes Low Bit 5
.equ	EEARL6	= 6 ; EEPROM Address Register  Bytes Low Bit 6
.equ	EEARL7	= 7 ; EEPROM Address Register  Bytes Low Bit 7

; EEDR - EEPROM Data Register
.equ	EEDR0	= 0 ; EEPROM Data Register Bit 0
.equ	EEDR1	= 1 ; EEPROM Data Register Bit 1
.equ	EEDR2	= 2 ; EEPROM Data Register Bit 2
.equ	EEDR3	= 3 ; EEPROM Data Register Bit 3
.equ	EEDR4	= 4 ; EEPROM Data Register Bit 4
.equ	EEDR5	= 5 ; EEPROM Data Register Bit 5
.equ	EEDR6	= 6 ; EEPROM Data Register Bit 6
.equ	EEDR7	= 7 ; EEPROM Data Register Bit 7

