trol73/avr-make/asm/include/m2564RFR2def.inc
; EECR - EEPROM Control Register
.equ	EERE	= 0 ; EEPROM Read Enable
.equ	EEPE	= 1 ; EEPROM Programming Enable
.equ	EEMPE	= 2 ; EEPROM Master Write Enable
.equ	EERIE	= 3 ; EEPROM Ready Interrupt Enable
.equ	EEPM0	= 4 ; EEPROM Programming Mode
.equ	EEPM1	= 5 ; EEPROM Programming Mode


; ***** JTAG *****************
; OCDR - On-Chip Debug Register
.equ	OCDR0	= 0 ; On-Chip Debug Register Data
.equ	OCDR1	= 1 ; On-Chip Debug Register Data
.equ	OCDR2	= 2 ; On-Chip Debug Register Data
.equ	OCDR3	= 3 ; On-Chip Debug Register Data
.equ	OCDR4	= 4 ; On-Chip Debug Register Data
.equ	OCDR5	= 5 ; On-Chip Debug Register Data
.equ	OCDR6	= 6 ; On-Chip Debug Register Data
.equ	OCDR7	= 7 ; On-Chip Debug Register Data

; MCUCR - MCU Control Register
.equ	JTD	= 7 ; JTAG Interface Disable

; MCUSR - MCU Status Register
.equ	JTRF	= 4 ; JTAG Reset Flag


; ***** EXTERNAL_INTERRUPT *****************
; EICRA - External Interrupt Control Register A
.equ	ISC00	= 0 ; External Interrupt 0 Sense Control Bit
.equ	ISC01	= 1 ; External Interrupt 0 Sense Control Bit
.equ	ISC10	= 2 ; External Interrupt 1 Sense Control Bit
.equ	ISC11	= 3 ; External Interrupt 1 Sense Control Bit
.equ	ISC20	= 4 ; External Interrupt 2 Sense Control Bit
.equ	ISC21	= 5 ; External Interrupt 2 Sense Control Bit
.equ	ISC30	= 6 ; External Interrupt 3 Sense Control Bit
.equ	ISC31	= 7 ; External Interrupt 3 Sense Control Bit

; EICRB - External Interrupt Control Register B
.equ	ISC40	= 0 ; External Interrupt 4 Sense Control Bit
.equ	ISC41	= 1 ; External Interrupt 4 Sense Control Bit
.equ	ISC50	= 2 ; External Interrupt 5 Sense Control Bit
.equ	ISC51	= 3 ; External Interrupt 5 Sense Control Bit
.equ	ISC60	= 4 ; External Interrupt 6 Sense Control Bit
.equ	ISC61	= 5 ; External Interrupt 6 Sense Control Bit
.equ	ISC70	= 6 ; External Interrupt 7 Sense Control Bit
.equ	ISC71	= 7 ; External Interrupt 7 Sense Control Bit

; EIMSK - External Interrupt Mask Register
.equ	INT0	= 0 ; External Interrupt Request Enable
.equ	INT1	= 1 ; External Interrupt Request Enable
.equ	INT2	= 2 ; External Interrupt Request Enable
.equ	INT3	= 3 ; External Interrupt Request Enable
.equ	INT4	= 4 ; External Interrupt Request Enable
.equ	INT5	= 5 ; External Interrupt Request Enable
.equ	INT6	= 6 ; External Interrupt Request Enable
.equ	INT7	= 7 ; External Interrupt Request Enable

; EIFR - External Interrupt Flag Register
.equ	INTF0	= 0 ; External Interrupt Flag
.equ	INTF1	= 1 ; External Interrupt Flag
.equ	INTF2	= 2 ; External Interrupt Flag
.equ	INTF3	= 3 ; External Interrupt Flag
.equ	INTF4	= 4 ; External Interrupt Flag
.equ	INTF5	= 5 ; External Interrupt Flag
.equ	INTF6	= 6 ; External Interrupt Flag
.equ	INTF7	= 7 ; External Interrupt Flag

; PCMSK2 - Pin Change Mask Register 2
.equ	PCINT16	= 0 ; Pin Change Enable Mask
.equ	PCINT17	= 1 ; Pin Change Enable Mask
.equ	PCINT18	= 2 ; Pin Change Enable Mask
.equ	PCINT19	= 3 ; Pin Change Enable Mask
.equ	PCINT20	= 4 ; Pin Change Enable Mask
.equ	PCINT21	= 5 ; Pin Change Enable Mask
.equ	PCINT22	= 6 ; Pin Change Enable Mask
.equ	PCINT23	= 7 ; Pin Change Enable Mask

; PCMSK1 - Pin Change Mask Register 1
.equ	PCINT8	= 0 ; Pin Change Enable Mask
.equ	PCINT9	= 1 ; Pin Change Enable Mask
.equ	PCINT10	= 2 ; Pin Change Enable Mask
.equ	PCINT11	= 3 ; Pin Change Enable Mask
.equ	PCINT12	= 4 ; Pin Change Enable Mask
.equ	PCINT13	= 5 ; Pin Change Enable Mask
.equ	PCINT14	= 6 ; Pin Change Enable Mask
.equ	PCINT15	= 7 ; Pin Change Enable Mask

; PCMSK0 - Pin Change Mask Register 0
.equ	PCMSK00	= 0 ; Pin Change Mask Register 0 Bit 0
.equ	PCMSK01	= 1 ; Pin Change Mask Register 0 Bit 1
.equ	PCMSK02	= 2 ; Pin Change Mask Register 0 Bit 2
.equ	PCMSK03	= 3 ; Pin Change Mask Register 0 Bit 3
.equ	PCMSK04	= 4 ; Pin Change Mask Register 0 Bit 4
.equ	PCMSK05	= 5 ; Pin Change Mask Register 0 Bit 5
.equ	PCMSK06	= 6 ; Pin Change Mask Register 0 Bit 6
.equ	PCMSK07	= 7 ; Pin Change Mask Register 0 Bit 7

; PCIFR - Pin Change Interrupt Flag Register
.equ	PCIF0	= 0 ; Pin Change Interrupt Flags
.equ	PCIF1	= 1 ; Pin Change Interrupt Flags
.equ	PCIF2	= 2 ; Pin Change Interrupt Flags

; PCICR - Pin Change Interrupt Control Register
.equ	PCIE0	= 0 ; Pin Change Interrupt Enables
.equ	PCIE1	= 1 ; Pin Change Interrupt Enables
.equ	PCIE2	= 2 ; Pin Change Interrupt Enables


; ***** AD_CONVERTER *****************
; ADMUX - The ADC Multiplexer Selection Register
.equ	MUX0	= 0 ; Analog Channel and Gain Selection Bits
.equ	MUX1	= 1 ; Analog Channel and Gain Selection Bits
.equ	MUX2	= 2 ; Analog Channel and Gain Selection Bits
.equ	MUX3	= 3 ; Analog Channel and Gain Selection Bits
.equ	MUX4	= 4 ; Analog Channel and Gain Selection Bits
.equ	ADLAR	= 5 ; ADC Left Adjust Result
.equ	REFS0	= 6 ; Reference Selection Bits
.equ	REFS1	= 7 ; Reference Selection Bits

; ADC - ADC Data Register  Bytes
.equ	ADCH0	= 0 ; ADC Data Register  Bytes High Bit 8
.equ	ADCH1	= 1 ; ADC Data Register  Bytes High Bit 9
.equ	ADCH2	= 2 ; ADC Data Register  Bytes High Bit 10
.equ	ADCH3	= 3 ; ADC Data Register  Bytes High Bit 11
.equ	ADCH4	= 4 ; ADC Data Register  Bytes High Bit 12
.equ	ADCH5	= 5 ; ADC Data Register  Bytes High Bit 13
.equ	ADCH6	= 6 ; ADC Data Register  Bytes High Bit 14
.equ	ADCH7	= 7 ; ADC Data Register  Bytes High Bit 15

.equ	ADCL0	= 0 ; ADC Data Register  Bytes Low Bit 0
.equ	ADCL1	= 1 ; ADC Data Register  Bytes Low Bit 1
.equ	ADCL2	= 2 ; ADC Data Register  Bytes Low Bit 2
.equ	ADCL3	= 3 ; ADC Data Register  Bytes Low Bit 3
.equ	ADCL4	= 4 ; ADC Data Register  Bytes Low Bit 4
.equ	ADCL5	= 5 ; ADC Data Register  Bytes Low Bit 5
.equ	ADCL6	= 6 ; ADC Data Register  Bytes Low Bit 6
.equ	ADCL7	= 7 ; ADC Data Register  Bytes Low Bit 7

; ADCSRA - The ADC Control and Status Register A
.equ	ADPS0	= 0 ; ADC  Prescaler Select Bits
.equ	ADPS1	= 1 ; ADC  Prescaler Select Bits
.equ	ADPS2	= 2 ; ADC  Prescaler Select Bits
.equ	ADIE	= 3 ; ADC Interrupt Enable
.equ	ADIF	= 4 ; ADC Interrupt Flag
.equ	ADATE	= 5 ; ADC Auto Trigger Enable
.equ	ADSC	= 6 ; ADC Start Conversion
.equ	ADEN	= 7 ; ADC Enable

; ADCSRB - The ADC Control and Status Register B
.equ	ADTS0	= 0 ; ADC Auto Trigger Source
.equ	ADTS1	= 1 ; ADC Auto Trigger Source
.equ	ADTS2	= 2 ; ADC Auto Trigger Source
.equ	MUX5	= 3 ; Analog Channel and Gain Selection Bits
.equ	ACCH	= 4 ; Analog Channel Change
.equ	REFOK	= 5 ; Reference Voltage OK
.equ	AVDDOK	= 7 ; AVDD Supply Voltage OK

; ADCSRC - The ADC Control and Status Register C
.equ	ADSUT0	= 0 ; ADC Start-up Time
.equ	ADSUT1	= 1 ; ADC Start-up Time
.equ	ADSUT2	= 2 ; ADC Start-up Time
.equ	ADSUT3	= 3 ; ADC Start-up Time
.equ	ADSUT4	= 4 ; ADC Start-up Time
.equ	ADTHT0	= 6 ; ADC Track-and-Hold Time
.equ	ADTHT1	= 7 ; ADC Track-and-Hold Time

