trol73/avr-make/asm/include/m2564RFR2def.inc
; DIDR2 - Digital Input Disable Register 2
.equ	ADC8D	= 0 ; Reserved Bits
.equ	ADC9D	= 1 ; Reserved Bits
.equ	ADC10D	= 2 ; Reserved Bits
.equ	ADC11D	= 3 ; Reserved Bits
.equ	ADC12D	= 4 ; Reserved Bits
.equ	ADC13D	= 5 ; Reserved Bits
.equ	ADC14D	= 6 ; Reserved Bits
.equ	ADC15D	= 7 ; Reserved Bits

; DIDR0 - Digital Input Disable Register 0
.equ	ADC0D	= 0 ; Disable ADC7:0 Digital Input
.equ	ADC1D	= 1 ; Disable ADC7:0 Digital Input
.equ	ADC2D	= 2 ; Disable ADC7:0 Digital Input
.equ	ADC3D	= 3 ; Disable ADC7:0 Digital Input
.equ	ADC4D	= 4 ; Disable ADC7:0 Digital Input
.equ	ADC5D	= 5 ; Disable ADC7:0 Digital Input
.equ	ADC6D	= 6 ; Disable ADC7:0 Digital Input
.equ	ADC7D	= 7 ; Disable ADC7:0 Digital Input


; ***** BOOT_LOAD *****************
; SPMCSR - Store Program Memory Control Register
.equ	SPMEN	= 0 ; Store Program Memory Enable
.equ	PGERS	= 1 ; Page Erase
.equ	PGWRT	= 2 ; Page Write
.equ	BLBSET	= 3 ; Boot Lock Bit Set
.equ	RWWSRE	= 4 ; Read While Write Section Read Enable
.equ	SIGRD	= 5 ; Signature Row Read
.equ	RWWSB	= 6 ; Read While Write Section Busy
.equ	SPMIE	= 7 ; SPM Interrupt Enable


; ***** CPU *****************
; SREG - Status Register
.equ	SREG_C	= 0 ; Carry Flag
.equ	SREG_Z	= 1 ; Zero Flag
.equ	SREG_N	= 2 ; Negative Flag
.equ	SREG_V	= 3 ; Two's Complement Overflow Flag
.equ	SREG_S	= 4 ; Sign Bit
.equ	SREG_H	= 5 ; Half Carry Flag
.equ	SREG_T	= 6 ; Bit Copy Storage
.equ	SREG_I	= 7 ; Global Interrupt Enable

; SP - Stack Pointer 
.equ	SPH0	= 0 ; Stack Pointer  High Bit 8
.equ	SPH1	= 1 ; Stack Pointer  High Bit 9
.equ	SPH2	= 2 ; Stack Pointer  High Bit 10
.equ	SPH3	= 3 ; Stack Pointer  High Bit 11
.equ	SPH4	= 4 ; Stack Pointer  High Bit 12
.equ	SPH5	= 5 ; Stack Pointer  High Bit 13
.equ	SPH6	= 6 ; Stack Pointer  High Bit 14
.equ	SPH7	= 7 ; Stack Pointer  High Bit 15

.equ	SPL0	= 0 ; Stack Pointer  Low Bit 0
.equ	SPL1	= 1 ; Stack Pointer  Low Bit 1
.equ	SPL2	= 2 ; Stack Pointer  Low Bit 2
.equ	SPL3	= 3 ; Stack Pointer  Low Bit 3
.equ	SPL4	= 4 ; Stack Pointer  Low Bit 4
.equ	SPL5	= 5 ; Stack Pointer  Low Bit 5
.equ	SPL6	= 6 ; Stack Pointer  Low Bit 6
.equ	SPL7	= 7 ; Stack Pointer  Low Bit 7

; MCUCR - MCU Control Register
.equ	IVCE	= 0 ; Interrupt Vector Change Enable
.equ	IVSEL	= 1 ; Interrupt Vector Select
.equ	PUD	= 4 ; Pull-up Disable

; MCUSR - MCU Status Register
.equ	PORF	= 0 ; Power-on Reset Flag
.equ	EXTRF	= 1 ; External Reset Flag
.equ	BORF	= 2 ; Brown-out Reset Flag
.equ	WDRF	= 3 ; Watchdog Reset Flag

; OSCCAL - Oscillator Calibration Value
.equ	CAL0	= 0 ; Oscillator Calibration Tuning Value
.equ	CAL1	= 1 ; Oscillator Calibration Tuning Value
.equ	CAL2	= 2 ; Oscillator Calibration Tuning Value
.equ	CAL3	= 3 ; Oscillator Calibration Tuning Value
.equ	CAL4	= 4 ; Oscillator Calibration Tuning Value
.equ	CAL5	= 5 ; Oscillator Calibration Tuning Value
.equ	CAL6	= 6 ; Oscillator Calibration Tuning Value
.equ	CAL7	= 7 ; Oscillator Calibration Tuning Value

; CLKPR - Clock Prescale Register
.equ	CLKPS0	= 0 ; Clock Prescaler Select Bits
.equ	CLKPS1	= 1 ; Clock Prescaler Select Bits
.equ	CLKPS2	= 2 ; Clock Prescaler Select Bits
.equ	CLKPS3	= 3 ; Clock Prescaler Select Bits
.equ	CLKPCE	= 7 ; Clock Prescaler Change Enable

; SMCR - Sleep Mode Control Register
.equ	SE	= 0 ; Sleep Enable
.equ	SM0	= 1 ; Sleep Mode Select bits
.equ	SM1	= 2 ; Sleep Mode Select bits
.equ	SM2	= 3 ; Sleep Mode Select bits

; EIND - Extended Indirect Register
.equ	EIND0	= 0 ; Extended Indirect Register Bit 0

; RAMPZ - Extended Z-pointer Register for ELPM/SPM
.equ	RAMPZ0	= 0 ; Extended Z-Pointer Value
.equ	RAMPZ1	= 1 ; Extended Z-Pointer Value

; GPIOR2 - General Purpose I/O Register 2
.equ	GPIOR20	= 0 ; General Purpose I/O Register 2 Value
.equ	GPIOR21	= 1 ; General Purpose I/O Register 2 Value
.equ	GPIOR22	= 2 ; General Purpose I/O Register 2 Value
.equ	GPIOR23	= 3 ; General Purpose I/O Register 2 Value
.equ	GPIOR24	= 4 ; General Purpose I/O Register 2 Value
.equ	GPIOR25	= 5 ; General Purpose I/O Register 2 Value
.equ	GPIOR26	= 6 ; General Purpose I/O Register 2 Value
.equ	GPIOR27	= 7 ; General Purpose I/O Register 2 Value

; GPIOR1 - General Purpose IO Register 1
.equ	GPIOR10	= 0 ; General Purpose I/O Register 1 Value
.equ	GPIOR11	= 1 ; General Purpose I/O Register 1 Value
.equ	GPIOR12	= 2 ; General Purpose I/O Register 1 Value
.equ	GPIOR13	= 3 ; General Purpose I/O Register 1 Value
.equ	GPIOR14	= 4 ; General Purpose I/O Register 1 Value
.equ	GPIOR15	= 5 ; General Purpose I/O Register 1 Value
.equ	GPIOR16	= 6 ; General Purpose I/O Register 1 Value
.equ	GPIOR17	= 7 ; General Purpose I/O Register 1 Value

; GPIOR0 - General Purpose IO Register 0
.equ	GPIOR00	= 0 ; General Purpose I/O Register 0 Value
.equ	GPIOR01	= 1 ; General Purpose I/O Register 0 Value
.equ	GPIOR02	= 2 ; General Purpose I/O Register 0 Value
.equ	GPIOR03	= 3 ; General Purpose I/O Register 0 Value
.equ	GPIOR04	= 4 ; General Purpose I/O Register 0 Value
.equ	GPIOR05	= 5 ; General Purpose I/O Register 0 Value
.equ	GPIOR06	= 6 ; General Purpose I/O Register 0 Value
.equ	GPIOR07	= 7 ; General Purpose I/O Register 0 Value

; PRR2 - Power Reduction Register 2
.equ	PRRAM0	= 0 ; Power Reduction SRAMs
.equ	PRRAM1	= 1 ; Power Reduction SRAMs
.equ	PRRAM2	= 2 ; Power Reduction SRAMs
.equ	PRRAM3	= 3 ; Power Reduction SRAMs

; PRR1 - Power Reduction Register 1
.equ	PRUSART1	= 0 ; Power Reduction USART1
.equ	PRTIM3	= 3 ; Power Reduction Timer/Counter3
.equ	PRTIM4	= 4 ; Power Reduction Timer/Counter4
.equ	PRTIM5	= 5 ; Power Reduction Timer/Counter5
.equ	PRTRX24	= 6 ; Power Reduction Transceiver

; PRR0 - Power Reduction Register0
.equ	PRADC	= 0 ; Power Reduction ADC
.equ	PRUSART0	= 1 ; Power Reduction USART
.equ	PRSPI	= 2 ; Power Reduction Serial Peripheral Interface
.equ	PRTIM1	= 3 ; Power Reduction Timer/Counter1
.equ	PRPGA	= 4 ; Power Reduction PGA
.equ	PRTIM0	= 5 ; Power Reduction Timer/Counter0
.equ	PRTIM2	= 6 ; Power Reduction Timer/Counter2
.equ	PRTWI	= 7 ; Power Reduction TWI


