trol73/avr-make/asm/include/m2564RFR2def.inc
; ***** FLASH *****************
; NEMCR - Flash Extended-Mode Control-Register
.equ	AEAM0	= 4 ; Address for Extended Address Mode of Extra Rows
.equ	AEAM1	= 5 ; Address for Extended Address Mode of Extra Rows
.equ	ENEAM	= 6 ; Enable Extended Address Mode for Extra Rows

; BGCR - Reference Voltage Calibration Register
.equ	BGCAL0	= 0 ; Coarse Calibration Bits
.equ	BGCAL1	= 1 ; Coarse Calibration Bits
.equ	BGCAL2	= 2 ; Coarse Calibration Bits
.equ	BGCAL_FINE0	= 3 ; Fine Calibration Bits
.equ	BGCAL_FINE1	= 4 ; Fine Calibration Bits
.equ	BGCAL_FINE2	= 5 ; Fine Calibration Bits
.equ	BGCAL_FINE3	= 6 ; Fine Calibration Bits


; ***** PWRCTRL *****************
; TRXPR - Transceiver Pin Register
.equ	TRXRST	= 0 ; Force Transceiver Reset
.equ	SLPTR	= 1 ; Multi-purpose Transceiver Control Bit

; DRTRAM0 - Data Retention Configuration Register #0
.equ	ENDRT	= 4 ; Enable SRAM Data Retention
.equ	DRTSWOK	= 5 ; DRT Switch OK

; DRTRAM1 - Data Retention Configuration Register #1

; DRTRAM2 - Data Retention Configuration Register #2

; DRTRAM3 - Data Retention Configuration Register #3

; LLDRL - Low Leakage Voltage Regulator Data Register (Low-Byte)
.equ	LLDRL0	= 0 ; Low-Byte Data Register Bits
.equ	LLDRL1	= 1 ; Low-Byte Data Register Bits
.equ	LLDRL2	= 2 ; Low-Byte Data Register Bits
.equ	LLDRL3	= 3 ; Low-Byte Data Register Bits

; LLDRH - Low Leakage Voltage Regulator Data Register (High-Byte)
.equ	LLDRH0	= 0 ; High-Byte Data Register Bits
.equ	LLDRH1	= 1 ; High-Byte Data Register Bits
.equ	LLDRH2	= 2 ; High-Byte Data Register Bits
.equ	LLDRH3	= 3 ; High-Byte Data Register Bits
.equ	LLDRH4	= 4 ; High-Byte Data Register Bits

; LLCR - Low Leakage Voltage Regulator Control Register
.equ	LLENCAL	= 0 ; Enable Automatic Calibration
.equ	LLSHORT	= 1 ; Short Lower Calibration Circuit
.equ	LLTCO	= 2 ; Temperature Coefficient of Current Source
.equ	LLCAL	= 3 ; Calibration Active
.equ	LLCOMP	= 4 ; Comparator Output
.equ	LLDONE	= 5 ; Calibration Done

; DPDS0 - Port Driver Strength Register 0
.equ	PBDRV0	= 0 ; Driver Strength Port B
.equ	PBDRV1	= 1 ; Driver Strength Port B
.equ	PDDRV0	= 2 ; Driver Strength Port D
.equ	PDDRV1	= 3 ; Driver Strength Port D
.equ	PEDRV0	= 4 ; Driver Strength Port E
.equ	PEDRV1	= 5 ; Driver Strength Port E
.equ	PFDRV0	= 6 ; Driver Strength Port F
.equ	PFDRV1	= 7 ; Driver Strength Port F

; DPDS1 - Port Driver Strength Register 1
.equ	PGDRV0	= 0 ; Driver Strength Port G
.equ	PGDRV1	= 1 ; Driver Strength Port G

; MCUCR - MCU Control Register


; ***** USART0_SPI *****************
; UCSR0A - USART0 MSPIM Control and Status Register A

; UCSR0B - USART0 MSPIM Control and Status Register B

; UCSR0C - USART0 MSPIM Control and Status Register C
.equ	UCPHA0	= 1 ; Clock Phase
.equ	UDORD0	= 2 ; Data Order


; ***** USART1_SPI *****************
; UCSR1A - USART1 MSPIM Control and Status Register A

; UCSR1B - USART1 MSPIM Control and Status Register B

; UCSR1C - USART1 MSPIM Control and Status Register C
.equ	UCPHA1	= 1 ; Clock Phase
.equ	UDORD1	= 2 ; Data Order


; ***** FUSE *****************
; EXTENDED - 
.equ	BODLEVEL0	= 0 ; Brown-out Detector trigger level
.equ	BODLEVEL1	= 1 ; Brown-out Detector trigger level
.equ	BODLEVEL2	= 2 ; Brown-out Detector trigger level

; HIGH - 
.equ	BOOTRST	= 0 ; Boot Reset vector Enabled
.equ	BOOTSZ0	= 1 ; Select Boot Size
.equ	BOOTSZ1	= 2 ; Select Boot Size
.equ	EESAVE	= 3 ; Preserve EEPROM through the Chip Erase cycle
.equ	WDTON	= 4 ; Watchdog timer always on
.equ	SPIEN	= 5 ; Serial program downloading (SPI) enabled
.equ	JTAGEN	= 6 ; JTAG Interface Enabled
.equ	OCDEN	= 7 ; On-Chip Debug Enabled

; LOW - 
.equ	CKSEL_SUT0	= 0 ; Select Clock Source : Start-up time
.equ	CKSEL_SUT1	= 1 ; Select Clock Source : Start-up time
.equ	CKSEL_SUT2	= 2 ; Select Clock Source : Start-up time
.equ	CKSEL_SUT3	= 3 ; Select Clock Source : Start-up time
.equ	CKSEL_SUT4	= 4 ; Select Clock Source : Start-up time
.equ	CKSEL_SUT5	= 5 ; Select Clock Source : Start-up time
.equ	CKOUT	= 6 ; Clock output on PORTE7
.equ	CKDIV8	= 7 ; Divide clock by 8 internally


; ***** LOCKBIT *****************
; LOCKBIT - 
.equ	LB1	= 0 ; Memory Lock
.equ	LB2	= 1 ; Memory Lock
.equ	BLB01	= 2 ; Boot Loader Protection Mode
.equ	BLB02	= 3 ; Boot Loader Protection Mode
.equ	BLB11	= 4 ; Boot Loader Protection Mode
.equ	BLB12	= 5 ; Boot Loader Protection Mode

; ***** CPU REGISTER DEFINITIONS *****************************************
.def	XH	= r27
.def	XL	= r26
.def	YH	= r29
.def	YL	= r28
.def	ZH	= r31
.def	ZL	= r30

; ***** DATA MEMORY DECLARATIONS *****************************************
.equ	FLASHSTART	= 0x0000 ; Note: Word address
.equ	FLASHEND	= 0x1FFFF ; Note: Word address
.equ	IOEND	= 0x01FF
.equ	SRAM_START	= 0x0200
.equ	SRAM_SIZE	= 32768
.equ	RAMEND	= 0x81FF
.equ	E2END	= 0x1FFF
.equ	EEPROMEND	= 0x1FFF
.equ	EEADRBITS	= 13
.equ	XRAMEND	= 0x0000
#pragma AVRPART MEMORY PROG_FLASH 262144
#pragma AVRPART MEMORY INT_SRAM SIZE 32768
#pragma AVRPART MEMORY INT_SRAM START_ADDR 0x200
#pragma AVRPART MEMORY EEPROM 8192

; ***** INTERRUPT VECTORS ************************************************
.equ	INT0addr	 = 0x0002 ; External Interrupt Request 0
.equ	INT1addr	 = 0x0004 ; External Interrupt Request 1
.equ	INT2addr	 = 0x0006 ; External Interrupt Request 2
.equ	INT3addr	 = 0x0008 ; External Interrupt Request 3
.equ	INT4addr	 = 0x000A ; External Interrupt Request 4
.equ	INT5addr	 = 0x000C ; External Interrupt Request 5
.equ	INT6addr	 = 0x000E ; External Interrupt Request 6
.equ	INT7addr	 = 0x0010 ; External Interrupt Request 7
.equ	PCINT0addr	 = 0x0012 ; Pin Change Interrupt Request 0
.equ	PCINT1addr	 = 0x0014 ; Pin Change Interrupt Request 1
.equ	PCINT2addr	 = 0x0016 ; Pin Change Interrupt Request 2
.equ	WDTaddr	 = 0x0018 ; Watchdog Time-out Interrupt
.equ	TIMER2_COMPAaddr	 = 0x001A ; Timer/Counter2 Compare Match A
.equ	TIMER2_COMPBaddr	 = 0x001C ; Timer/Counter2 Compare Match B
.equ	TIMER2_OVFaddr	 = 0x001E ; Timer/Counter2 Overflow
.equ	TIMER1_CAPTaddr	 = 0x0020 ; Timer/Counter1 Capture Event
.equ	TIMER1_COMPAaddr	 = 0x0022 ; Timer/Counter1 Compare Match A
.equ	TIMER1_COMPBaddr	 = 0x0024 ; Timer/Counter1 Compare Match B
.equ	TIMER1_COMPCaddr	 = 0x0026 ; Timer/Counter1 Compare Match C
.equ	TIMER1_OVFaddr	 = 0x0028 ; Timer/Counter1 Overflow
.equ	TIMER0_COMPAaddr	 = 0x002A ; Timer/Counter0 Compare Match A
.equ	TIMER0_COMPBaddr	 = 0x002C ; Timer/Counter0 Compare Match B
.equ	TIMER0_OVFaddr	 = 0x002E ; Timer/Counter0 Overflow
.equ	SPI_STCaddr	 = 0x0030 ; SPI Serial Transfer Complete
.equ	USART0_RXaddr	 = 0x0032 ; USART0, Rx Complete
.equ	USART0_UDREaddr	 = 0x0034 ; USART0 Data register Empty
.equ	USART0_TXaddr	 = 0x0036 ; USART0, Tx Complete
.equ	ANALOG_COMPaddr	 = 0x0038 ; Analog Comparator
.equ	ADCaddr	 = 0x003A ; ADC Conversion Complete
.equ	EE_READYaddr	 = 0x003C ; EEPROM Ready
.equ	TIMER3_CAPTaddr	 = 0x003E ; Timer/Counter3 Capture Event
.equ	TIMER3_COMPAaddr	 = 0x0040 ; Timer/Counter3 Compare Match A
.equ	TIMER3_COMPBaddr	 = 0x0042 ; Timer/Counter3 Compare Match B
.equ	TIMER3_COMPCaddr	 = 0x0044 ; Timer/Counter3 Compare Match C
.equ	TIMER3_OVFaddr	 = 0x0046 ; Timer/Counter3 Overflow
.equ	USART1_RXaddr	 = 0x0048 ; USART1, Rx Complete
.equ	USART1_UDREaddr	 = 0x004A ; USART1 Data register Empty
.equ	USART1_TXaddr	 = 0x004C ; USART1, Tx Complete
.equ	TWIaddr	 = 0x004E ; 2-wire Serial Interface
.equ	SPM_READYaddr	 = 0x0050 ; Store Program Memory Read
.equ	TIMER4_CAPTaddr	 = 0x0052 ; Timer/Counter4 Capture Event
.equ	TIMER4_COMPAaddr	 = 0x0054 ; Timer/Counter4 Compare Match A
.equ	TIMER4_COMPBaddr	 = 0x0056 ; Timer/Counter4 Compare Match B
.equ	TIMER4_COMPCaddr	 = 0x0058 ; Timer/Counter4 Compare Match C
.equ	TIMER4_OVFaddr	 = 0x005A ; Timer/Counter4 Overflow
.equ	TIMER5_CAPTaddr	 = 0x005C ; Timer/Counter5 Capture Event
.equ	TIMER5_COMPAaddr	 = 0x005E ; Timer/Counter5 Compare Match A
.equ	TIMER5_COMPBaddr	 = 0x0060 ; Timer/Counter5 Compare Match B
.equ	TIMER5_COMPCaddr	 = 0x0062 ; Timer/Counter5 Compare Match C
.equ	TIMER5_OVFaddr	 = 0x0064 ; Timer/Counter5 Overflow
.equ	USART2_RXaddr	 = 0x0066 ; USART2, Rx Complete
.equ	USART2_UDREaddr	 = 0x0068 ; USART2 Data register Empty
.equ	USART2_TXaddr	 = 0x006A ; USART2, Tx Complete
.equ	USART3_RXaddr	 = 0x006C ; USART3, Rx Complete
.equ	USART3_UDREaddr	 = 0x006E ; USART3 Data register Empty
.equ	USART3_TXaddr	 = 0x0070 ; USART3, Tx Complete
.equ	TRX24_PLL_LOCKaddr	 = 0x0072 ; TRX24 - PLL lock interrupt
.equ	TRX24_PLL_UNLOCKaddr	 = 0x0074 ; TRX24 - PLL unlock interrupt
.equ	TRX24_RX_STARTaddr	 = 0x0076 ; TRX24 - Receive start interrupt
.equ	TRX24_RX_ENDaddr	 = 0x0078 ; TRX24 - RX_END interrupt
.equ	TRX24_CCA_ED_DONEaddr	 = 0x007A ; TRX24 - CCA/ED done interrupt
.equ	TRX24_XAH_AMIaddr	 = 0x007C ; TRX24 - XAH - AMI
.equ	TRX24_TX_ENDaddr	 = 0x007E ; TRX24 - TX_END interrupt
.equ	TRX24_AWAKEaddr	 = 0x0080 ; TRX24 AWAKE - tranceiver is reaching state TRX_OFF
.equ	SCNT_CMP1addr	 = 0x0082 ; Symbol counter - compare match 1 interrupt
.equ	SCNT_CMP2addr	 = 0x0084 ; Symbol counter - compare match 2 interrupt
.equ	SCNT_CMP3addr	 = 0x0086 ; Symbol counter - compare match 3 interrupt
.equ	SCNT_OVFLaddr	 = 0x0088 ; Symbol counter - overflow interrupt
.equ	SCNT_BACKOFFaddr	 = 0x008A ; Symbol counter - backoff interrupt
.equ	AES_READYaddr	 = 0x008C ; AES engine ready interrupt
.equ	BAT_LOWaddr	 = 0x008E ; Battery monitor indicates supply voltage below threshold
.equ	TRX24_TX_STARTaddr	 = 0x0090 ; TRX24 TX start interrupt
.equ	TRX24_AMI0addr	 = 0x0092 ; Address match interrupt of address filter 0
.equ	TRX24_AMI1addr	 = 0x0094 ; Address match interrupt of address filter 1
.equ	TRX24_AMI2addr	 = 0x0096 ; Address match interrupt of address filter 2
.equ	TRX24_AMI3addr	 = 0x0098 ; Address match interrupt of address filter 3

.equ	INT_VECTORS_SIZE	= 154 ; size in words

#endif /* _M2564RFR2DEF_INC_ */

; ***** END OF FILE ******************************************************



